/*
 Navicat Premium Data Transfer

 Source Server         : localhost-MYSQL8.0
 Source Server Type    : MySQL
 Source Server Version : 80012
 Source Host           : localhost:3306
 Source Schema         : ruoyi_vue

 Target Server Type    : MySQL
 Target Server Version : 80012
 File Encoding         : 65001

 Date: 11/10/2024 14:07:39
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for class_schedule
-- ----------------------------
DROP TABLE IF EXISTS `class_schedule`;
CREATE TABLE `class_schedule`  (
  `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT,
  `single_double_week` int(11) NULL DEFAULT NULL COMMENT '是否单双周课程（0：否，1：单周，2：双周）',
  `class_id` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '班级id',
  `class_hour_id` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '课时id',
  `teacher_id` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '老师id',
  `subject_id` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '科目id',
  `modify_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `deleted` tinyint(1) NULL DEFAULT 0,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `fk_class`(`class_id` ASC) USING BTREE,
  INDEX `fk_class_hour`(`class_hour_id` ASC) USING BTREE,
  INDEX `fk_teacher`(`teacher_id` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1611 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of class_schedule
-- ----------------------------
INSERT INTO `class_schedule` VALUES (1, 0, '1年1班', '周1第1节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (2, 0, '1年1班', '周1第2节', '陈郑宇', '数学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (3, 0, '1年1班', '周1第3节', '阮智慧', '英语', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (4, 0, '1年1班', '周1第4节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (5, 0, '1年1班', '周1第5节', '陈群清', '道德与法治', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (6, 0, '1年1班', '周1第6节', '郑少燕', '劳动', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (7, 0, '1年1班', '周1第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (8, 0, '1年1班', '周2第1节', '阮智慧', '英语', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (9, 0, '1年1班', '周2第2节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (10, 0, '1年1班', '周2第3节', '王红', '音乐', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (11, 0, '1年1班', '周2第4节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (12, 0, '1年1班', '周2第5节', '李丹琪', '美术', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (13, 0, '1年1班', '周2第6节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (14, 0, '1年1班', '周2第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (15, 0, '1年1班', '周3第1节', '陈郑宇', '数学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (16, 0, '1年1班', '周3第2节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (17, 0, '1年1班', '周3第3节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (18, 0, '1年1班', '周3第4节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (19, 1, '1年1班', '周3第5节', '郑少燕', '心理健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (20, 2, '1年1班', '周3第5节', '阮智慧', '英语绘本', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (21, 0, '1年1班', '周3第6节', '郑少燕', '科学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (22, 0, '1年1班', '周3第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (23, 0, '1年1班', '周4第1节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (24, 0, '1年1班', '周4第2节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (25, 0, '1年1班', '周4第3节', '陈郑宇', '数学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (26, 0, '1年1班', '周4第4节', '陈群清', '道德与法治', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (27, 0, '1年1班', '周4第5节', '阮智慧', '综合实践', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (28, 0, '1年1班', '周4第6节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (29, 0, '1年1班', '周4第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (30, 0, '1年1班', '周5第1节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (31, 0, '1年1班', '周5第2节', '郑少燕', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (32, 0, '1年1班', '周5第3节', '王红', '音乐', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (33, 0, '1年1班', '周5第4节', '李丹琪', '美术', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (34, 0, '1年1班', '周5第5节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (35, 0, '1年1班', '周5第6节', '陈郑宇', '数基', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (36, 0, '1年1班', '周5第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (37, 0, '1年2班', '周1第1节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (38, 0, '1年2班', '周1第2节', '阮智慧', '英语', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (39, 0, '1年2班', '周1第3节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (40, 0, '1年2班', '周1第4节', '陈群清', '道德与法治', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (41, 0, '1年2班', '周1第5节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (42, 0, '1年2班', '周1第6节', '何明帆', '劳动', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (43, 0, '1年2班', '周1第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (44, 0, '1年2班', '周2第1节', '陈郑宇', '数学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (45, 0, '1年2班', '周2第2节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (46, 0, '1年2班', '周2第3节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (47, 0, '1年2班', '周2第4节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (48, 0, '1年2班', '周2第5节', '王红', '音乐', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (49, 0, '1年2班', '周2第6节', '何明帆', '科学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (50, 0, '1年2班', '周2第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (51, 0, '1年2班', '周3第1节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (52, 0, '1年2班', '周3第2节', '陈郑宇', '数学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (53, 0, '1年2班', '周3第3节', '李丹琪', '美术', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (54, 0, '1年2班', '周3第4节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (55, 1, '1年2班', '周3第5节', '阮智慧', '英语绘本', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (56, 2, '1年2班', '周3第5节', '何明帆', '心理健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (57, 0, '1年2班', '周3第6节', '陈群清', '道德与法治', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (58, 0, '1年2班', '周3第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (59, 0, '1年2班', '周4第1节', '陈郑宇', '数学', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (60, 0, '1年2班', '周4第2节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (61, 0, '1年2班', '周4第3节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (62, 0, '1年2班', '周4第4节', '王红', '音乐', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (63, 0, '1年2班', '周4第5节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (64, 0, '1年2班', '周4第6节', '阮智慧', '综合实践', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (65, 0, '1年2班', '周4第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (66, 0, '1年2班', '周5第1节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (67, 0, '1年2班', '周5第2节', '阮智慧', '英语', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (68, 0, '1年2班', '周5第3节', '陈郑宇', '数基', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (69, 0, '1年2班', '周5第4节', '何明帆', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (70, 0, '1年2班', '周5第5节', '李丹琪', '美术', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (71, 0, '1年2班', '周5第6节', '彭硕', '体育与健康', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (72, 0, '1年2班', '周5第7节', NULL, NULL, '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (73, 0, '1年3班', '周1第1节', '寇青兰', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (74, 0, '1年3班', '周1第2节', '寇青兰', '语文', '2024-09-14 15:33:18', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (75, 0, '1年3班', '周1第3节', '陈郑宇', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (76, 0, '1年3班', '周1第4节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (77, 0, '1年3班', '周1第5节', '阮智慧', '综合实践', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (78, 0, '1年3班', '周1第6节', '寇青兰', '劳动', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (79, 0, '1年3班', '周1第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (80, 0, '1年3班', '周2第1节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (81, 0, '1年3班', '周2第2节', '陈郑宇', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (82, 0, '1年3班', '周2第3节', '陈群清', '道德与法治', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (83, 1, '1年3班', '周2第4节', '阮智慧', '英语绘本', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (84, 2, '1年3班', '周2第4节', '寇青兰', '心理健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (85, 0, '1年3班', '周2第5节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (86, 0, '1年3班', '周2第6节', '李丹琪', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (87, 0, '1年3班', '周2第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (88, 0, '1年3班', '周3第1节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (89, 0, '1年3班', '周3第2节', '阮智慧', '英语', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (90, 0, '1年3班', '周3第3节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (91, 0, '1年3班', '周3第4节', '王红', '音乐', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (92, 0, '1年3班', '周3第5节', '李丹琪', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (93, 0, '1年3班', '周3第6节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (94, 0, '1年3班', '周3第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (95, 0, '1年3班', '周4第1节', '阮智慧', '英语', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (96, 0, '1年3班', '周4第2节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (97, 0, '1年3班', '周4第3节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (98, 0, '1年3班', '周4第4节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (99, 0, '1年3班', '周4第5节', '陈郑宇', '数基', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (100, 0, '1年3班', '周4第6节', '寇青兰', '科学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (101, 0, '1年3班', '周4第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (102, 0, '1年3班', '周5第1节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (103, 0, '1年3班', '周5第2节', '陈郑宇', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (104, 0, '1年3班', '周5第3节', '寇青兰', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (105, 0, '1年3班', '周5第4节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (106, 0, '1年3班', '周5第5节', '陈群清', '道德与法治', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (107, 0, '1年3班', '周5第6节', '王红', '音乐', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (108, 0, '1年3班', '周5第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (109, 0, '1年4班', '周1第1节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (110, 0, '1年4班', '周1第2节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (111, 0, '1年4班', '周1第3节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (112, 0, '1年4班', '周1第4节', '王红', '音乐', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (113, 0, '1年4班', '周1第5节', '周娟', '数基', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (114, 0, '1年4班', '周1第6节', '梁胜琴', '劳动', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (115, 0, '1年4班', '周1第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (116, 0, '1年4班', '周2第1节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (117, 0, '1年4班', '周2第2节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (118, 0, '1年4班', '周2第3节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (119, 0, '1年4班', '周2第4节', '李丹琪', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (120, 0, '1年4班', '周2第5节', '陈群清', '道德与法治', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (121, 0, '1年4班', '周2第6节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (122, 0, '1年4班', '周2第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (123, 0, '1年4班', '周3第1节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (124, 0, '1年4班', '周3第2节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (125, 0, '1年4班', '周3第3节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (126, 0, '1年4班', '周3第4节', '阮智慧', '英语', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (127, 0, '1年4班', '周3第5节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (128, 0, '1年4班', '周3第6节', '梁胜琴', '科学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (129, 0, '1年4班', '周3第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (130, 0, '1年4班', '周4第1节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (131, 0, '1年4班', '周4第2节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (132, 0, '1年4班', '周4第3节', '彭硕', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (133, 1, '1年4班', '周4第4节', '梁胜琴', '心理健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (134, 2, '1年4班', '周4第4节', '阮智慧', '英语绘本', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (135, 0, '1年4班', '周4第5节', '王红', '音乐', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (136, 0, '1年4班', '周4第6节', '李丹琪', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (137, 0, '1年4班', '周4第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (138, 0, '1年4班', '周5第1节', '阮智慧', '英语', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (139, 0, '1年4班', '周5第2节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (140, 0, '1年4班', '周5第3节', '梁胜琴', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (141, 0, '1年4班', '周5第4节', '陈群清', '道德与法治', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (142, 0, '1年4班', '周5第5节', '阮智慧', '综合实践', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (143, 0, '1年4班', '周5第6节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (144, 0, '1年4班', '周5第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (145, 0, '1年5班', '周1第1节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (146, 0, '1年5班', '周1第2节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (147, 0, '1年5班', '周1第3节', '张家伟', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (148, 0, '1年5班', '周1第4节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (149, 0, '1年5班', '周1第5节', '王红', '音乐', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (150, 0, '1年5班', '周1第6节', '余宛蓉', '劳动', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (151, 0, '1年5班', '周1第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (152, 0, '1年5班', '周2第1节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (153, 0, '1年5班', '周2第2节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (154, 1, '1年5班', '周2第3节', '余宛蓉', '心理健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (155, 2, '1年5班', '周2第3节', '王婧', '英语绘本', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (156, 0, '1年5班', '周2第4节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (157, 0, '1年5班', '周2第5节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (158, 0, '1年5班', '周2第6节', '陈群清', '道德与法治', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (159, 0, '1年5班', '周2第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (160, 0, '1年5班', '周3第1节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (161, 0, '1年5班', '周3第2节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (162, 0, '1年5班', '周3第3节', '李可意', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (163, 0, '1年5班', '周3第4节', '王婧', '英语', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (164, 0, '1年5班', '周3第5节', '张家伟', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (165, 0, '1年5班', '周3第6节', '余宛蓉', '科学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (166, 0, '1年5班', '周3第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (167, 0, '1年5班', '周4第1节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (168, 0, '1年5班', '周4第2节', '王婧', '英语', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (169, 0, '1年5班', '周4第3节', '张家伟', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (170, 0, '1年5班', '周4第4节', '李可意', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (171, 0, '1年5班', '周4第5节', '周娟', '数基', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (172, 0, '1年5班', '周4第6节', '陈群清', '道德与法治', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (173, 0, '1年5班', '周4第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (174, 0, '1年5班', '周5第1节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (175, 0, '1年5班', '周5第2节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (176, 0, '1年5班', '周5第3节', '余宛蓉', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (177, 0, '1年5班', '周5第4节', '王红', '音乐', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (178, 0, '1年5班', '周5第5节', '王婧', '综合实践', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (179, 0, '1年5班', '周5第6节', '张家伟', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (180, 0, '1年5班', '周5第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (181, 0, '1年6班', '周1第1节', '郭瑜雯', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (182, 0, '1年6班', '周1第2节', '郭瑜雯', '语文', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (183, 0, '1年6班', '周1第3节', '周娟', '数学', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (184, 0, '1年6班', '周1第4节', '李可意', '美术', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (185, 0, '1年6班', '周1第5节', '张家伟', '体育与健康', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (186, 0, '1年6班', '周1第6节', '郭瑜雯', '劳动', '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (187, 0, '1年6班', '周1第7节', NULL, NULL, '2024-09-14 15:33:19', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (188, 0, '1年6班', '周2第1节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (189, 0, '1年6班', '周2第2节', '王婧', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (190, 0, '1年6班', '周2第3节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (191, 0, '1年6班', '周2第4节', '李可意', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (192, 0, '1年6班', '周2第5节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (193, 0, '1年6班', '周2第6节', '郭瑜雯', '科学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (194, 0, '1年6班', '周2第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (195, 0, '1年6班', '周3第1节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (196, 0, '1年6班', '周3第2节', '周娟', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (197, 0, '1年6班', '周3第3节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (198, 0, '1年6班', '周3第4节', '陈群清', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (199, 1, '1年6班', '周3第5节', '郭瑜雯', '心理健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (200, 2, '1年6班', '周3第5节', '王婧', '英语绘本', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (201, 0, '1年6班', '周3第6节', '赵接娣', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (202, 0, '1年6班', '周3第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (203, 0, '1年6班', '周4第1节', '周娟', '数基', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (204, 0, '1年6班', '周4第2节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (205, 0, '1年6班', '周4第3节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (206, 0, '1年6班', '周4第4节', '赵接娣', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (207, 0, '1年6班', '周4第5节', '陈群清', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (208, 0, '1年6班', '周4第6节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (209, 0, '1年6班', '周4第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (210, 0, '1年6班', '周5第1节', '王婧', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (211, 0, '1年6班', '周5第2节', '周娟', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (212, 0, '1年6班', '周5第3节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (213, 0, '1年6班', '周5第4节', '郭瑜雯', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (214, 0, '1年6班', '周5第5节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (215, 0, '1年6班', '周5第6节', '王婧', '综合实践', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (216, 0, '1年6班', '周5第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (217, 0, '1年7班', '周1第1节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (218, 0, '1年7班', '周1第2节', '彭艳霞', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (219, 0, '1年7班', '周1第3节', '王婧', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (220, 0, '1年7班', '周1第4节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (221, 0, '1年7班', '周1第5节', '彭惠敏', '综合实践', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (222, 0, '1年7班', '周1第6节', '刘晓娜', '劳动', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (223, 0, '1年7班', '周1第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (224, 0, '1年7班', '周2第1节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (225, 0, '1年7班', '周2第2节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (226, 0, '1年7班', '周2第3节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (227, 0, '1年7班', '周2第4节', '陈群清', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (228, 0, '1年7班', '周2第5节', '李可意', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (229, 0, '1年7班', '周2第6节', '刘晓娜', '科学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (230, 0, '1年7班', '周2第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (231, 0, '1年7班', '周3第1节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (232, 0, '1年7班', '周3第2节', '彭艳霞', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (233, 0, '1年7班', '周3第3节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (234, 0, '1年7班', '周3第4节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (235, 1, '1年7班', '周3第5节', '王婧', '英语绘本', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (236, 2, '1年7班', '周3第5节', '刘晓娜', '心理健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (237, 0, '1年7班', '周3第6节', '黄静', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (238, 0, '1年7班', '周3第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (239, 0, '1年7班', '周4第1节', '王婧', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (240, 0, '1年7班', '周4第2节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (241, 0, '1年7班', '周4第3节', '彭艳霞', '数基', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (242, 0, '1年7班', '周4第4节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (243, 0, '1年7班', '周4第5节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (244, 0, '1年7班', '周4第6节', '黄静', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (245, 0, '1年7班', '周4第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (246, 0, '1年7班', '周5第1节', '彭艳霞', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (247, 0, '1年7班', '周5第2节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (248, 0, '1年7班', '周5第3节', '刘晓娜', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (249, 0, '1年7班', '周5第4节', '张家伟', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (250, 0, '1年7班', '周5第5节', '李可意', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (251, 0, '1年7班', '周5第6节', '陈群清', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (252, 0, '1年7班', '周5第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (253, 0, '1年8班', '周1第1节', '彭艳霞', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (254, 0, '1年8班', '周1第2节', '王婧', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (255, 0, '1年8班', '周1第3节', '陈群清', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (256, 0, '1年8班', '周1第4节', '邱祎峰', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (257, 0, '1年8班', '周1第5节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (258, 0, '1年8班', '周1第6节', '彭艳霞', '劳动', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (259, 0, '1年8班', '周1第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (260, 0, '1年8班', '周2第1节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (261, 0, '1年8班', '周2第2节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (262, 0, '1年8班', '周2第3节', '彭艳霞', '数基', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (263, 1, '1年8班', '周2第4节', '王婧', '英语绘本', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (264, 2, '1年8班', '周2第4节', '彭艳霞', '心理健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (265, 0, '1年8班', '周2第5节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (266, 0, '1年8班', '周2第6节', '胡蝶', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (267, 0, '1年8班', '周2第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (268, 0, '1年8班', '周3第1节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (269, 0, '1年8班', '周3第2节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (270, 0, '1年8班', '周3第3节', '王婧', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (271, 0, '1年8班', '周3第4节', '丘祎峰', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (272, 0, '1年8班', '周3第5节', '陈群清', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (273, 0, '1年8班', '周3第6节', '李可意', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (274, 0, '1年8班', '周3第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (275, 0, '1年8班', '周4第1节', '彭艳霞', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (276, 0, '1年8班', '周4第2节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (277, 0, '1年8班', '周4第3节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (278, 0, '1年8班', '周4第4节', '丘祎峰', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (279, 0, '1年8班', '周4第5节', '彭惠敏', '综合实践', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (280, 0, '1年8班', '周4第6节', '胡蝶', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (281, 0, '1年8班', '周4第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (282, 0, '1年8班', '周5第1节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (283, 0, '1年8班', '周5第2节', '楼毅', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (284, 0, '1年8班', '周5第3节', '彭艳霞', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (285, 0, '1年8班', '周5第4节', '李可意', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (286, 0, '1年8班', '周5第5节', '彭艳霞', '科学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (287, 0, '1年8班', '周5第6节', '丘祎峰', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (288, 0, '1年8班', '周5第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (289, 0, '2年1班', '周1第1节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (290, 0, '2年1班', '周1第2节', '刘羊立', '数基', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (291, 0, '2年1班', '周1第3节', '陈杭秀', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (292, 0, '2年1班', '周1第4节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (293, 0, '2年1班', '周1第5节', '郑思越', '科学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (294, 0, '2年1班', '周1第6节', '黄丽嫦', '劳动', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (295, 0, '2年1班', '周1第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (296, 0, '2年1班', '周2第1节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (297, 0, '2年1班', '周2第2节', '刘羊立', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (298, 0, '2年1班', '周2第3节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (299, 0, '2年1班', '周2第4节', '龙小侠', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (300, 0, '2年1班', '周2第5节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (301, 0, '2年1班', '周2第6节', '黄凤莲', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (302, 0, '2年1班', '周2第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (303, 0, '2年1班', '周3第1节', '刘羊立', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (304, 0, '2年1班', '周3第2节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (305, 0, '2年1班', '周3第3节', '陈杭秀', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (306, 0, '2年1班', '周3第4节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (307, 0, '2年1班', '周3第5节', '黄丽嫦', '语文阅读', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (308, 0, '2年1班', '周3第6节', '黄凤莲', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (309, 0, '2年1班', '周3第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (310, 0, '2年1班', '周4第1节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (311, 0, '2年1班', '周4第2节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (312, 0, '2年1班', '周4第3节', '李丹琪', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (313, 0, '2年1班', '周4第4节', '龙小侠', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (314, 0, '2年1班', '周4第5节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (315, 0, '2年1班', '周4第6节', '黄丽嫦', '综合实践', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (316, 0, '2年1班', '周4第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (317, 0, '2年1班', '周5第1节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (318, 0, '2年1班', '周5第2节', '黄丽嫦', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (319, 0, '2年1班', '周5第3节', '刘羊立', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (320, 0, '2年1班', '周5第4节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (321, 1, '2年1班', '周5第5节', '陈杭秀', '英语绘本', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (322, 2, '2年1班', '周5第5节', '谢颖', '心理健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (323, 0, '2年1班', '周5第6节', '李丹琪', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (324, 0, '2年1班', '周5第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (325, 0, '2年2班', '周1第1节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (326, 0, '2年2班', '周1第2节', '陈杭秀', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (327, 0, '2年2班', '周1第3节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (328, 0, '2年2班', '周1第4节', '郑思越', '科学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (329, 0, '2年2班', '周1第5节', '李丹琪', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (330, 0, '2年2班', '周1第6节', '曾婷燕', '劳动', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (331, 0, '2年2班', '周1第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (332, 0, '2年2班', '周2第1节', '陈杭秀', '英语', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (333, 0, '2年2班', '周2第2节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (334, 0, '2年2班', '周2第3节', '刘羊立', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (335, 0, '2年2班', '周2第4节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (336, 0, '2年2班', '周2第5节', '黄凤莲', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (337, 0, '2年2班', '周2第6节', '曾婷燕', '语文阅读', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (338, 0, '2年2班', '周2第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (339, 0, '2年2班', '周3第1节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (340, 0, '2年2班', '周3第2节', '刘羊立', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (341, 0, '2年2班', '周3第3节', '龙小侠', '音乐', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (342, 0, '2年2班', '周3第4节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (343, 0, '2年2班', '周3第5节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (344, 0, '2年2班', '周3第6节', '曾婷燕', '综合实践', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (345, 0, '2年2班', '周3第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (346, 0, '2年2班', '周4第1节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (347, 0, '2年2班', '周4第2节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (348, 0, '2年2班', '周4第3节', '刘羊立', '数学', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (349, 0, '2年2班', '周4第4节', '李丹琪', '美术', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (350, 1, '2年2班', '周4第5节', '谢颖', '心理健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (351, 2, '2年2班', '周4第5节', '陈杭秀', '英语绘本', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (352, 0, '2年2班', '周4第6节', '欧阳荣', '体育与健康', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (353, 0, '2年2班', '周4第7节', NULL, NULL, '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (354, 0, '2年2班', '周5第1节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (355, 0, '2年2班', '周5第2节', '曾婷燕', '语文', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (356, 0, '2年2班', '周5第3节', '黄凤莲', '道德与法治', '2024-09-14 15:33:20', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (357, 0, '2年2班', '周5第4节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (358, 0, '2年2班', '周5第5节', '刘羊立', '数基', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (359, 0, '2年2班', '周5第6节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (360, 0, '2年2班', '周5第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (361, 0, '2年3班', '周1第1节', '刘羊立', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (362, 0, '2年3班', '周1第2节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (363, 0, '2年3班', '周1第3节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (364, 0, '2年3班', '周1第4节', '赵韵怡', '综合实践', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (365, 0, '2年3班', '周1第5节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (366, 0, '2年3班', '周1第6节', '赵韵怡', '劳动', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (367, 0, '2年3班', '周1第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (368, 0, '2年3班', '周2第1节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (369, 0, '2年3班', '周2第2节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (370, 0, '2年3班', '周2第3节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (371, 1, '2年3班', '周2第4节', '陈杭秀', '英语绘本', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (372, 2, '2年3班', '周2第4节', '谢颖', '心理健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (373, 0, '2年3班', '周2第5节', '刘羊立', '数基', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (374, 0, '2年3班', '周2第6节', '赵韵怡', '语文阅读', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (375, 0, '2年3班', '周2第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (376, 0, '2年3班', '周3第1节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (377, 0, '2年3班', '周3第2节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (378, 0, '2年3班', '周3第3节', '郑思越', '科学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (379, 0, '2年3班', '周3第4节', '李丹琪', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (380, 0, '2年3班', '周3第5节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (381, 0, '2年3班', '周3第6节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (382, 0, '2年3班', '周3第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (383, 0, '2年3班', '周4第1节', '刘羊立', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (384, 0, '2年3班', '周4第2节', '陈杭秀', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (385, 0, '2年3班', '周4第3节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (386, 0, '2年3班', '周4第4节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (387, 0, '2年3班', '周4第5节', '李丹琪', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (388, 0, '2年3班', '周4第6节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (389, 0, '2年3班', '周4第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (390, 0, '2年3班', '周5第1节', '陈杭秀', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (391, 0, '2年3班', '周5第2节', '刘羊立', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (392, 0, '2年3班', '周5第3节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (393, 0, '2年3班', '周5第4节', '赵韵怡', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (394, 0, '2年3班', '周5第5节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (395, 0, '2年3班', '周5第6节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (396, 0, '2年3班', '周5第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (397, 0, '2年4班', '周1第1节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (398, 0, '2年4班', '周1第2节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (399, 0, '2年4班', '周1第3节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (400, 0, '2年4班', '周1第4节', '李丹琪', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (401, 0, '2年4班', '周1第5节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (402, 0, '2年4班', '周1第6节', '李兰兰', '劳动', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (403, 0, '2年4班', '周1第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (404, 0, '2年4班', '周2第1节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (405, 0, '2年4班', '周2第2节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (406, 0, '2年4班', '周2第3节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (407, 1, '2年4班', '周2第4节', '谢颖', '心理健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (408, 2, '2年4班', '周2第4节', '陈杭秀', '英语绘本', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (409, 0, '2年4班', '周2第5节', '李兰兰', '综合实践', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (410, 0, '2年4班', '周2第6节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (411, 0, '2年4班', '周2第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (412, 0, '2年4班', '周3第1节', '陈杭秀', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (413, 0, '2年4班', '周3第2节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (414, 0, '2年4班', '周3第3节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (415, 0, '2年4班', '周3第4节', '李兰兰', '语文阅读', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (416, 0, '2年4班', '周3第5节', '郑思越', '科学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (417, 0, '2年4班', '周3第6节', '李丹琪', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (418, 0, '2年4班', '周3第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (419, 0, '2年4班', '周4第1节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (420, 0, '2年4班', '周4第2节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (421, 0, '2年4班', '周4第3节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (422, 0, '2年4班', '周4第4节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (423, 0, '2年4班', '周4第5节', '李茹', '数基', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (424, 0, '2年4班', '周4第6节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (425, 0, '2年4班', '周4第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (426, 0, '2年4班', '周5第1节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (427, 0, '2年4班', '周5第2节', '李兰兰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (428, 0, '2年4班', '周5第3节', '陈杭秀', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (429, 0, '2年4班', '周5第4节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (430, 0, '2年4班', '周5第5节', '欧阳荣', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (431, 0, '2年4班', '周5第6节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (432, 0, '2年4班', '周5第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (433, 0, '2年5班', '周1第1节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (434, 0, '2年5班', '周1第2节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (435, 0, '2年5班', '周1第3节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (436, 0, '2年5班', '周1第4节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (437, 0, '2年5班', '周1第5节', '陈杭秀', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (438, 0, '2年5班', '周1第6节', '赵延玲', '劳动', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (439, 0, '2年5班', '周1第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (440, 0, '2年5班', '周2第1节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (441, 0, '2年5班', '周2第2节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (442, 0, '2年5班', '周2第3节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (443, 0, '2年5班', '周2第4节', '龙爱科', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (444, 0, '2年5班', '周2第5节', '赵延玲', '综合实践', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (445, 0, '2年5班', '周2第6节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (446, 0, '2年5班', '周2第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (447, 0, '2年5班', '周3第1节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (448, 0, '2年5班', '周3第2节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (449, 0, '2年5班', '周3第3节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (450, 0, '2年5班', '周3第4节', '龙小侠', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (451, 1, '2年5班', '周3第5节', '陈杭秀', '英语绘本', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (452, 2, '2年5班', '周3第5节', '谢颖', '心理健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (453, 0, '2年5班', '周3第6节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (454, 0, '2年5班', '周3第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (455, 0, '2年5班', '周4第1节', '陈杭秀', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (456, 0, '2年5班', '周4第2节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (457, 0, '2年5班', '周4第3节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (458, 0, '2年5班', '周4第4节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (459, 0, '2年5班', '周4第5节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (460, 0, '2年5班', '周4第6节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (461, 0, '2年5班', '周4第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (462, 0, '2年5班', '周5第1节', '赵延玲', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (463, 0, '2年5班', '周5第2节', '李茹', '数基', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (464, 0, '2年5班', '周5第3节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (465, 0, '2年5班', '周5第4节', '赵延玲', '语文阅读', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (466, 0, '2年5班', '周5第5节', '龙爱科', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (467, 0, '2年5班', '周5第6节', '郑思越', '科学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (468, 0, '2年5班', '周5第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (469, 0, '2年6班', '周1第1节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (470, 0, '2年6班', '周1第2节', '钟小娥', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (471, 0, '2年6班', '周1第3节', '邱祎峰', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (472, 0, '2年6班', '周1第4节', '洪彭仰', '语文阅读', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (473, 0, '2年6班', '周1第5节', '龙爱科', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (474, 0, '2年6班', '周1第6节', '洪彭仰', '劳动', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (475, 0, '2年6班', '周1第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (476, 0, '2年6班', '周2第1节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (477, 0, '2年6班', '周2第2节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (478, 0, '2年6班', '周2第3节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (479, 0, '2年6班', '周2第4节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (480, 0, '2年6班', '周2第5节', '丘祎峰', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (481, 0, '2年6班', '周2第6节', '吴采怡', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (482, 0, '2年6班', '周2第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (483, 0, '2年6班', '周3第1节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (484, 0, '2年6班', '周3第2节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (485, 0, '2年6班', '周3第3节', '李茹', '数基', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (486, 0, '2年6班', '周3第4节', '黄凤莲', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (487, 1, '2年6班', '周3第5节', '谢颖', '心理健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (488, 2, '2年6班', '周3第5节', '钟小娥', '英语绘本', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (489, 0, '2年6班', '周3第6节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (490, 0, '2年6班', '周3第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (491, 0, '2年6班', '周4第1节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (492, 0, '2年6班', '周4第2节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (493, 0, '2年6班', '周4第3节', '丘祎峰', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (494, 0, '2年6班', '周4第4节', '洪彭仰', '综合实践', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (495, 0, '2年6班', '周4第5节', '郑思越', '科学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (496, 0, '2年6班', '周4第6节', '龙爱科', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (497, 0, '2年6班', '周4第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (498, 0, '2年6班', '周5第1节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (499, 0, '2年6班', '周5第2节', '洪彭仰', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (500, 0, '2年6班', '周5第3节', '吴采怡', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (501, 0, '2年6班', '周5第4节', '丘祎峰', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (502, 0, '2年6班', '周5第5节', '钟小娥', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (503, 0, '2年6班', '周5第6节', '李茹', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (504, 0, '2年6班', '周5第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (505, 0, '2年7班', '周1第1节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (506, 0, '2年7班', '周1第2节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (507, 0, '2年7班', '周1第3节', '徐一玖', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (508, 0, '2年7班', '周1第4节', '张婷', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (509, 0, '2年7班', '周1第5节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (510, 0, '2年7班', '周1第6节', '朱莲娣', '劳动', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (511, 0, '2年7班', '周1第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (512, 0, '2年7班', '周2第1节', '彭雪枫', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (513, 0, '2年7班', '周2第2节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (514, 0, '2年7班', '周2第3节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (515, 0, '2年7班', '周2第4节', '徐一玖', '综合实践', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (516, 0, '2年7班', '周2第5节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (517, 0, '2年7班', '周2第6节', '何珊', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (518, 0, '2年7班', '周2第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (519, 0, '2年7班', '周3第1节', '徐一玖', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (520, 0, '2年7班', '周3第2节', '彭雪枫', '数基', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (521, 0, '2年7班', '周3第3节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (522, 0, '2年7班', '周3第4节', '朱莲娣', '体育与健康1', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (523, 0, '2年7班', '周3第5节', '李可意', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (524, 0, '2年7班', '周3第6节', '张婷', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (525, 0, '2年7班', '周3第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (526, 0, '2年7班', '周4第1节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (527, 0, '2年7班', '周4第2节', '彭雪枫', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (528, 0, '2年7班', '周4第3节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (529, 0, '2年7班', '周4第4节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (530, 1, '2年7班', '周4第5节', '徐一玖', '英语绘本', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (531, 2, '2年7班', '周4第5节', '谢颖', '心理健康', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (532, 0, '2年7班', '周4第6节', '李可意', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (533, 0, '2年7班', '周4第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (534, 0, '2年7班', '周5第1节', '朱莲娣', '语文', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (535, 0, '2年7班', '周5第2节', '彭雪枫', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (536, 0, '2年7班', '周5第3节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (537, 0, '2年7班', '周5第4节', '朱莲娣', '语文阅读', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (538, 0, '2年7班', '周5第5节', '胡胜伟', '科学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (539, 0, '2年7班', '周5第6节', '何珊', '道德与法治', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (540, 0, '2年7班', '周5第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (541, 0, '2年8班', '周1第1节', '彭雪枫', '英语', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (542, 0, '2年8班', '周1第2节', '罗丽娜', '数学', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (543, 0, '2年8班', '周1第3节', '李可意', '美术', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (544, 0, '2年8班', '周1第4节', '林晓青', '音乐', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (545, 0, '2年8班', '周1第5节', '易文婷', '体育与健康（形体）', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (546, 0, '2年8班', '周1第6节', '彭雪枫', '劳动', '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (547, 0, '2年8班', '周1第7节', NULL, NULL, '2024-09-14 15:33:21', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (548, 0, '2年8班', '周2第1节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (549, 0, '2年8班', '周2第2节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (550, 0, '2年8班', '周2第3节', '彭雪枫', '数基', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (551, 0, '2年8班', '周2第4节', '林晓青', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (552, 0, '2年8班', '周2第5节', '刘灿芳', '语文阅读', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (553, 0, '2年8班', '周2第6节', '彭雪枫', '体育与健康2', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (554, 0, '2年8班', '周2第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (555, 0, '2年8班', '周3第1节', '罗丽娜', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (556, 0, '2年8班', '周3第2节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (557, 0, '2年8班', '周3第3节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (558, 0, '2年8班', '周3第4节', '何珊', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (559, 0, '2年8班', '周3第5节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (560, 0, '2年8班', '周3第6节', '何珊', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (561, 0, '2年8班', '周3第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (562, 0, '2年8班', '周4第1节', '彭雪枫', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (563, 0, '2年8班', '周4第2节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (564, 0, '2年8班', '周4第3节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (565, 1, '2年8班', '周4第4节', '谢颖', '心理健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (566, 2, '2年8班', '周4第4节', '罗丽娜', '英语绘本', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (567, 0, '2年8班', '周4第5节', '胡胜伟', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (568, 0, '2年8班', '周4第6节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (569, 0, '2年8班', '周4第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (570, 0, '2年8班', '周5第1节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (571, 0, '2年8班', '周5第2节', '刘灿芳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (572, 0, '2年8班', '周5第3节', '彭雪枫', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (573, 0, '2年8班', '周5第4节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (574, 0, '2年8班', '周5第5节', '彭雪枫', '综合实践', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (575, 0, '2年8班', '周5第6节', '李可意', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (576, 0, '2年8班', '周5第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (577, 0, '2年9班', '周1第1节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (578, 0, '2年9班', '周1第2节', '李可意', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (579, 0, '2年9班', '周1第3节', '陈美燕', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (580, 0, '2年9班', '周1第4节', '盘诗卉', '语文阅读', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (581, 0, '2年9班', '周1第5节', '邱祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (582, 0, '2年9班', '周1第6节', '盘诗卉', '劳动', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (583, 0, '2年9班', '周1第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (584, 0, '2年9班', '周2第1节', '孙继云', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (585, 0, '2年9班', '周2第2节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (586, 0, '2年9班', '周2第3节', '陈美燕', '数基', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (587, 0, '2年9班', '周2第4节', '董奕虹', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (588, 0, '2年9班', '周2第5节', '陈美燕', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (589, 0, '2年9班', '周2第6节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (590, 0, '2年9班', '周2第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (591, 0, '2年9班', '周3第1节', '陈美燕', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (592, 0, '2年9班', '周3第2节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (593, 0, '2年9班', '周3第3节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (594, 0, '2年9班', '周3第4节', '李可意', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (595, 0, '2年9班', '周3第5节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (596, 0, '2年9班', '周3第6节', '盘诗卉', '综合实践', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (597, 0, '2年9班', '周3第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (598, 0, '2年9班', '周4第1节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (599, 0, '2年9班', '周4第2节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (600, 0, '2年9班', '周4第3节', '陈美燕', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (601, 0, '2年9班', '周4第4节', '孙继云', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (602, 0, '2年9班', '周4第5节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (603, 0, '2年9班', '周4第6节', '董奕虹', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (604, 0, '2年9班', '周4第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (605, 0, '2年9班', '周5第1节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (606, 0, '2年9班', '周5第2节', '盘诗卉', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (607, 0, '2年9班', '周5第3节', '陈美燕', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (608, 0, '2年9班', '周5第4节', '郑思越', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (609, 0, '2年9班', '周5第5节', '龙小侠', '体育与健康（形体）', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (610, 1, '2年9班', '周5第6节', '谢颖', '心理健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (611, 2, '2年9班', '周5第6节', '孙继云', '英语绘本', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (612, 0, '2年9班', '周5第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (613, 0, '2年10班', '周1第1节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (614, 0, '2年10班', '周1第2节', '陈美燕', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (615, 0, '2年10班', '周1第3节', '彭惠敏', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (616, 0, '2年10班', '周1第4节', '龙小侠', '体育与健康（形体）', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (617, 0, '2年10班', '周1第5节', '陈美燕', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (618, 0, '2年10班', '周1第6节', '何冰', '劳动', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (619, 0, '2年10班', '周1第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (620, 0, '2年10班', '周2第1节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (621, 0, '2年10班', '周2第2节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (622, 0, '2年10班', '周2第3节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (623, 0, '2年10班', '周2第4节', '郑思越', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (624, 0, '2年10班', '周2第5节', '何冰', '综合实践', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (625, 0, '2年10班', '周2第6节', '李可意', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (626, 0, '2年10班', '周2第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (627, 0, '2年10班', '周3第1节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (628, 0, '2年10班', '周3第2节', '陈美燕', '数基', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (629, 0, '2年10班', '周3第3节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (630, 1, '2年10班', '周3第4节', '彭惠敏', '英语绘本', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (631, 2, '2年10班', '周3第4节', '谢颖', '心理健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (632, 0, '2年10班', '周3第5节', '董奕虹', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (633, 0, '2年10班', '周3第6节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (634, 0, '2年10班', '周3第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (635, 0, '2年10班', '周4第1节', '陈美燕', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (636, 0, '2年10班', '周4第2节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (637, 0, '2年10班', '周4第3节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (638, 0, '2年10班', '周4第4节', '董奕虹', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (639, 0, '2年10班', '周4第5节', '李可意', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (640, 0, '2年10班', '周4第6节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (641, 0, '2年10班', '周4第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (642, 0, '2年10班', '周5第1节', '彭惠敏', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (643, 0, '2年10班', '周5第2节', '陈美燕', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (644, 0, '2年10班', '周5第3节', '何冰', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (645, 0, '2年10班', '周5第4节', '何冰', '语文阅读', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (646, 0, '2年10班', '周5第5节', '丘祎峰', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (647, 0, '2年10班', '周5第6节', '陈美燕', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (648, 0, '2年10班', '周5第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (649, 0, '3年1班', '周1第1节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (650, 0, '3年1班', '周1第2节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (651, 0, '3年1班', '周1第3节', '柳国嫦', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (652, 0, '3年1班', '周1第4节', '吴文博', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (653, 0, '3年1班', '周1第5节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (654, 0, '3年1班', '周1第6节', '胡佳', '劳动', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (655, 0, '3年1班', '周1第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (656, 0, '3年1班', '周2第1节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (657, 0, '3年1班', '周2第2节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (658, 0, '3年1班', '周2第3节', '黄钢锋', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (659, 0, '3年1班', '周2第4节', '唐舒婷', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (660, 0, '3年1班', '周2第5节', '文彩儿', '语文阅读', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (661, 0, '3年1班', '周2第6节', '胡佳', '体育与健康2', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (662, 0, '3年1班', '周2第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (663, 0, '3年1班', '周3第1节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (664, 0, '3年1班', '周3第2节', '唐舒婷', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (665, 0, '3年1班', '周3第3节', '李灵', '信技', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (666, 0, '3年1班', '周3第4节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (667, 0, '3年1班', '周3第5节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (668, 0, '3年1班', '周3第6节', '翟旭坤', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (669, 0, '3年1班', '周3第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (670, 0, '3年1班', '周4第1节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (671, 0, '3年1班', '周4第2节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (672, 0, '3年1班', '周4第3节', '陈伊玲', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (673, 0, '3年1班', '周4第4节', '翟旭坤', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (674, 0, '3年1班', '周4第5节', '柳国嫦', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (675, 1, '3年1班', '周4第6节', '唐舒婷', '综合实践', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (676, 2, '3年1班', '周4第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (677, 0, '3年1班', '周4第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (678, 0, '3年1班', '周5第1节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (679, 0, '3年1班', '周5第2节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (680, 0, '3年1班', '周5第3节', '唐舒婷', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (681, 0, '3年1班', '周5第4节', '吴文博', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (682, 0, '3年1班', '周5第4节', '陈伊玲', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (683, 0, '3年1班', '周5第5节', '黄钢锋', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (684, 0, '3年1班', '周5第6节', '胡佳', '体育与健康2', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (685, 0, '3年1班', '周5第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (686, 0, '3年2班', '周1第1节', '唐舒婷', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (687, 0, '3年2班', '周1第2节', '胡佳', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (688, 0, '3年2班', '周1第3节', '庄静瑜', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (689, 0, '3年2班', '周1第4节', '文彩儿', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (690, 0, '3年2班', '周1第5节', '黄福安', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (691, 0, '3年2班', '周1第6节', '唐舒婷', '劳动', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (692, 0, '3年2班', '周1第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (693, 0, '3年2班', '周2第1节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (694, 0, '3年2班', '周2第2节', '唐舒婷', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (695, 0, '3年2班', '周2第3节', '陈伊玲', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (696, 0, '3年2班', '周2第4节', '文彩儿', '体育与健康2', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (697, 0, '3年2班', '周2第5节', '李灵', '信技', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (698, 0, '3年2班', '周2第6节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (699, 0, '3年2班', '周2第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (700, 0, '3年2班', '周3第1节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (701, 0, '3年2班', '周3第2节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (702, 0, '3年2班', '周3第3节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (703, 0, '3年2班', '周3第4节', '黄钢锋', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (704, 0, '3年2班', '周3第5节', '吴文博', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (705, 0, '3年2班', '周3第6节', '文彩儿', '语文阅读', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (706, 0, '3年2班', '周3第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (707, 0, '3年2班', '周4第1节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (708, 0, '3年2班', '周4第2节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (709, 0, '3年2班', '周4第3节', '黄钢锋', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (710, 0, '3年2班', '周4第4节', '张景雄', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (711, 0, '3年2班', '周4第5节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (712, 1, '3年2班', '周4第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (713, 2, '3年2班', '周4第6节', '唐舒婷', '综合实践', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (714, 0, '3年2班', '周4第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (715, 0, '3年2班', '周5第1节', '庄静瑜', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (716, 0, '3年2班', '周5第2节', '唐舒婷', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (717, 0, '3年2班', '周5第3节', '胡佳', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (718, 1, '3年2班', '周5第4节', '陈伊玲', '美术', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (719, 2, '3年2班', '周5第4节', '吴文博', '音乐', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (720, 0, '3年2班', '周5第5节', '黄福安', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (721, 0, '3年2班', '周5第6节', '张景雄', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (722, 0, '3年2班', '周5第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (723, 0, '3年3班', '周1第1节', '于小航', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (724, 0, '3年3班', '周1第2节', '张雯', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (725, 0, '3年3班', '周1第3节', '唐舒婷', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (726, 0, '3年3班', '周1第4节', '于小航', '体育与健康2', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (727, 0, '3年3班', '周1第5节', '陈伊玲', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (728, 0, '3年3班', '周1第6节', '于小航', '劳动', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (729, 0, '3年3班', '周1第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (730, 0, '3年3班', '周2第1节', '张雯', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (731, 0, '3年3班', '周2第2节', '于小航', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (732, 0, '3年3班', '周2第3节', '于小航', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (733, 0, '3年3班', '周2第4节', '黄福安', '道德与法治', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (734, 0, '3年3班', '周2第5节', '黄钢锋', '科学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (735, 0, '3年3班', '周2第6节', '张景雄', '体育与健康', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (736, 0, '3年3班', '周2第7节', NULL, NULL, '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (737, 0, '3年3班', '周3第1节', '张雯', '数学', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (738, 0, '3年3班', '周3第2节', '于小航', '语文', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (739, 0, '3年3班', '周3第3节', '唐舒婷', '英语', '2024-09-14 15:33:22', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (740, 0, '3年3班', '周3第4节', '张景雄', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (741, 0, '3年3班', '周3第5节', '于小航', '语文阅读', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (742, 0, '3年3班', '周3第6节', '吴文博', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (743, 0, '3年3班', '周3第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (744, 0, '3年3班', '周4第1节', '唐舒婷', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (745, 0, '3年3班', '周4第2节', '于小航', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (746, 1, '3年3班', '周4第3节', '郭霄涵', '心理健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (747, 2, '3年3班', '周4第3节', '唐舒婷', '综合实践', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (748, 1, '3年3班', '周4第4节', '吴文博', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (749, 2, '3年3班', '周4第4节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (750, 0, '3年3班', '周4第5节', '黄钢锋', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (751, 0, '3年3班', '周4第6节', '于小航', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (752, 0, '3年3班', '周4第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (753, 0, '3年3班', '周5第1节', '于小航', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (754, 0, '3年3班', '周5第2节', '于小航', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (755, 0, '3年3班', '周5第3节', '张雯', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (756, 0, '3年3班', '周5第4节', '李灵', '信技', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (757, 0, '3年3班', '周5第5节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (758, 0, '3年3班', '周5第6节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (759, 0, '3年3班', '周5第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (760, 0, '3年4班', '周1第1节', '张雯', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (761, 0, '3年4班', '周1第2节', '文彩儿', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (762, 0, '3年4班', '周1第3节', '卢龙云', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (763, 0, '3年4班', '周1第4节', '黄福安', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (764, 0, '3年4班', '周1第5节', '张景雄', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (765, 0, '3年4班', '周1第6节', '张雯', '劳动', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (766, 0, '3年4班', '周1第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (767, 0, '3年4班', '周2第1节', '文彩儿', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (768, 0, '3年4班', '周2第2节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (769, 0, '3年4班', '周2第3节', '吴文博', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (770, 0, '3年4班', '周2第4节', '李灵', '信技', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (771, 0, '3年4班', '周2第5节', '张雯', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (772, 0, '3年4班', '周2第6节', '卢龙云', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (773, 0, '3年4班', '周2第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (774, 0, '3年4班', '周3第1节', '文彩儿', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (775, 0, '3年4班', '周3第2节', '文彩儿', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (776, 0, '3年4班', '周3第3节', '张雯', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (777, 0, '3年4班', '周3第4节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (778, 0, '3年4班', '周3第5节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (779, 0, '3年4班', '周3第6节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (780, 0, '3年4班', '周3第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (781, 0, '3年4班', '周4第1节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (782, 0, '3年4班', '周4第2节', '文彩儿', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (783, 0, '3年4班', '周4第3节', '张雯', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (784, 1, '3年4班', '周4第4节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (785, 2, '3年4班', '周4第4节', '吴文博', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (786, 0, '3年4班', '周4第5节', '张景雄', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (787, 0, '3年4班', '周4第6节', '文彩儿', '语文阅读', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (788, 0, '3年4班', '周4第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (789, 0, '3年4班', '周5第1节', '张雯', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (790, 0, '3年4班', '周5第2节', '文彩儿', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (791, 0, '3年4班', '周5第3节', '文彩儿', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (792, 1, '3年4班', '周5第4节', '郭霄涵', '心理健康', '2024-10-10 15:31:46', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (793, 2, '3年4班', '周5第4节', '苏思慧', '综合实践', '2024-10-10 15:31:59', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (794, 0, '3年4班', '周5第5节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (795, 0, '3年4班', '周5第6节', '张雯', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (796, 0, '3年4班', '周5第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (797, 0, '3年5班', '周1第1节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (798, 0, '3年5班', '周1第2节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (799, 0, '3年5班', '周1第3节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (800, 0, '3年5班', '周1第4节', '张景雄', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (801, 0, '3年5班', '周1第5节', '吴文博', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (802, 0, '3年5班', '周1第6节', '吴淑萍', '劳动', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (803, 0, '3年5班', '周1第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (804, 0, '3年5班', '周2第1节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (805, 0, '3年5班', '周2第2节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (806, 0, '3年5班', '周2第3节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (807, 0, '3年5班', '周2第4节', '吴淑萍', '语文阅读', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (808, 0, '3年5班', '周2第5节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (809, 0, '3年5班', '周2第6节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (810, 0, '3年5班', '周2第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (811, 0, '3年5班', '周3第1节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (812, 0, '3年5班', '周3第2节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (813, 0, '3年5班', '周3第3节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (814, 1, '3年5班', '周3第4节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (815, 2, '3年5班', '周3第4节', '吴文博', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (816, 0, '3年5班', '周3第5节', '吴淑萍', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (817, 0, '3年5班', '周3第6节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (818, 0, '3年5班', '周3第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (819, 0, '3年5班', '周4第1节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (820, 0, '3年5班', '周4第2节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (821, 0, '3年5班', '周4第3节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (822, 0, '3年5班', '周4第4节', '吴淑萍', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (823, 0, '3年5班', '周4第5节', '卢龙云', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (824, 0, '3年5班', '周4第6节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (825, 0, '3年5班', '周4第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (826, 0, '3年5班', '周5第1节', '吴淑萍', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (827, 0, '3年5班', '周5第2节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (828, 0, '3年5班', '周5第3节', '李灵', '信技', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (829, 1, '3年5班', '周5第4节', '苏思慧', '综合实践', '2024-10-10 15:31:03', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (830, 2, '3年5班', '周5第4节', '郭霄涵', '心理健康', '2024-10-10 15:31:12', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (831, 0, '3年5班', '周5第5节', '张景雄', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (832, 0, '3年5班', '周5第6节', '卢龙云', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (833, 0, '3年5班', '周5第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (834, 0, '3年6班', '周1第1节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (835, 0, '3年6班', '周1第2节', '王芳', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (836, 0, '3年6班', '周1第3节', '张彤彤', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (837, 0, '3年6班', '周1第4节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (838, 0, '3年6班', '周1第5节', '林晓枫', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (839, 0, '3年6班', '周1第6节', '张彤彤', '劳动', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (840, 0, '3年6班', '周1第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (841, 0, '3年6班', '周2第1节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (842, 0, '3年6班', '周2第2节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (843, 0, '3年6班', '周2第3节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (844, 0, '3年6班', '周2第4节', '张景雄', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (845, 0, '3年6班', '周2第5节', '黄淑灵', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (846, 0, '3年6班', '周2第6节', '张彤彤', '语文阅读', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (847, 0, '3年6班', '周2第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (848, 0, '3年6班', '周3第1节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (849, 0, '3年6班', '周3第2节', '王芳', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (850, 0, '3年6班', '周3第3节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (851, 0, '3年6班', '周3第4节', '张彤彤', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (852, 1, '3年6班', '周3第5节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (853, 2, '3年6班', '周3第5节', '黄淑灵', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (854, 0, '3年6班', '周3第6节', '李灵', '信技', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (855, 0, '3年6班', '周3第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (856, 0, '3年6班', '周4第1节', '王芳', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (857, 0, '3年6班', '周4第2节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (858, 0, '3年6班', '周4第3节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (859, 0, '3年6班', '周4第4节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (860, 0, '3年6班', '周4第5节', '林晓枫', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (861, 0, '3年6班', '周4第6节', '张景雄', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (862, 0, '3年6班', '周4第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (863, 0, '3年6班', '周5第1节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (864, 0, '3年6班', '周5第2节', '张彤彤', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (865, 0, '3年6班', '周5第3节', '杨思迪', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (866, 0, '3年6班', '周5第4节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (867, 1, '3年6班', '周5第5节', '郭霄涵', '心理健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (868, 2, '3年6班', '周5第5节', '王芳', '综合实践', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (869, 0, '3年6班', '周5第6节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (870, 0, '3年6班', '周5第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (871, 0, '3年7班', '周1第1节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (872, 0, '3年7班', '周1第2节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (873, 0, '3年7班', '周1第3节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (874, 0, '3年7班', '周1第4节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (875, 1, '3年7班', '周1第5节', '黄淑灵', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (876, 2, '3年7班', '周1第5节', '郭霄涵', '心理健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (877, 0, '3年7班', '周1第6节', '叶巧红', '劳动', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (878, 0, '3年7班', '周1第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (879, 0, '3年7班', '周2第1节', '王芳', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (880, 0, '3年7班', '周2第2节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (881, 0, '3年7班', '周2第3节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (882, 0, '3年7班', '周2第4节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (883, 0, '3年7班', '周2第5节', '林晓枫', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (884, 0, '3年7班', '周2第6节', '叶巧红', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (885, 0, '3年7班', '周2第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (886, 0, '3年7班', '周3第1节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (887, 0, '3年7班', '周3第2节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (888, 0, '3年7班', '周3第3节', '叶巧红', '语文阅读', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (889, 0, '3年7班', '周3第4节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (890, 1, '3年7班', '周3第5节', '王芳', '综合实践', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (891, 2, '3年7班', '周3第5节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (892, 0, '3年7班', '周3第6节', '张家伟', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (893, 0, '3年7班', '周3第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (894, 0, '3年7班', '周4第1节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (895, 0, '3年7班', '周4第2节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (896, 0, '3年7班', '周4第3节', '王芳', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (897, 0, '3年7班', '周4第4节', '黄淑灵', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (898, 0, '3年7班', '周4第5节', '张家伟', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (899, 0, '3年7班', '周4第6节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (900, 0, '3年7班', '周4第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (901, 0, '3年7班', '周5第1节', '王芳', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (902, 0, '3年7班', '周5第2节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (903, 0, '3年7班', '周5第3节', '叶巧红', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (904, 0, '3年7班', '周5第4节', '叶巧红', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (905, 0, '3年7班', '周5第5节', '李灵', '信技', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (906, 0, '3年7班', '周5第6节', '林晓枫', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (907, 0, '3年7班', '周5第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (908, 0, '3年8班', '周1第1节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (909, 0, '3年8班', '周1第2节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (910, 0, '3年8班', '周1第3节', '黄淑灵', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (911, 0, '3年8班', '周1第4节', '黄淑灵', '语文阅读', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (912, 0, '3年8班', '周1第5节', '邱密丽', '体育与健康2', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (913, 0, '3年8班', '周1第6节', '苏思慧', '劳动', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (914, 0, '3年8班', '周1第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (915, 0, '3年8班', '周2第1节', '黄淑灵', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (916, 0, '3年8班', '周2第2节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (917, 0, '3年8班', '周2第3节', '黄淑灵', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (918, 0, '3年8班', '周2第4节', '张家伟', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (919, 0, '3年8班', '周2第5节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (920, 0, '3年8班', '周2第6节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (921, 0, '3年8班', '周2第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (922, 0, '3年8班', '周3第1节', '黄淑灵', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (923, 0, '3年8班', '周3第2节', '黄淑灵', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (924, 0, '3年8班', '周3第3节', '苏思慧', '英语', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (925, 1, '3年8班', '周3第4节', '郭霄涵', '心理健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (926, 2, '3年8班', '周3第4节', '陈伊玲', '美术', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (927, 0, '3年8班', '周3第5节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (928, 1, '3年8班', '周3第6节', '黄淑灵', '音乐', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (929, 2, '3年8班', '周3第6节', '苏思慧', '综合实践', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (930, 0, '3年8班', '周3第7节', NULL, NULL, '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (931, 0, '3年8班', '周4第1节', '邱密丽', '数学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (932, 0, '3年8班', '周4第2节', '黄淑灵', '语文', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (933, 0, '3年8班', '周4第3节', '林晓枫', '科学', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (934, 0, '3年8班', '周4第4节', '张家伟', '体育与健康', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (935, 0, '3年8班', '周4第5节', '黄福安', '道德与法治', '2024-09-14 15:33:23', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (936, 0, '3年8班', '周4第6节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (937, 0, '3年8班', '周4第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (938, 0, '3年8班', '周5第1节', '邱密丽', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (939, 0, '3年8班', '周5第2节', '苏思慧', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (940, 0, '3年8班', '周5第3节', '黄淑灵', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (941, 0, '3年8班', '周5第4节', '黄淑灵', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (942, 0, '3年8班', '周5第5节', '林晓枫', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (943, 0, '3年8班', '周5第6节', '邱密丽', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (944, 0, '3年8班', '周5第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (945, 0, '4年1班', '周1第1节', '李美琴', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (946, 0, '4年1班', '周1第2节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (947, 0, '4年1班', '周1第3节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (948, 0, '4年1班', '周1第4节', '李美琴', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (949, 0, '4年1班', '周1第5节', '钟敏', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (950, 0, '4年1班', '周1第6节', '李美琴', '劳动', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (951, 0, '4年1班', '周1第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (952, 0, '4年1班', '周2第1节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (953, 0, '4年1班', '周2第2节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (954, 0, '4年1班', '周2第3节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (955, 0, '4年1班', '周2第4节', '邱奕斌', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (956, 0, '4年1班', '周2第5节', '杨浩阳', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (957, 0, '4年1班', '周2第6节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (958, 0, '4年1班', '周2第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (959, 0, '4年1班', '周3第1节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (960, 0, '4年1班', '周3第2节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (961, 0, '4年1班', '周3第3节', '李美琴', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (962, 0, '4年1班', '周3第4节', '龙爱科', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (963, 0, '4年1班', '周3第5节', '邱奕斌', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (964, 0, '4年1班', '周3第6节', '李美琴', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (965, 0, '4年1班', '周3第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (966, 0, '4年1班', '周4第1节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (967, 0, '4年1班', '周4第2节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (968, 0, '4年1班', '周4第3节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (969, 1, '4年1班', '周4第4节', '龙爱科', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (970, 2, '4年1班', '周4第4节', '杨浩阳', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (971, 0, '4年1班', '周4第5节', '钟敏', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (972, 0, '4年1班', '周4第6节', '吴剑军', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (973, 0, '4年1班', '周4第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (974, 0, '4年1班', '周5第1节', '李美琴', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (975, 0, '4年1班', '周5第2节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (976, 0, '4年1班', '周5第3节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (977, 0, '4年1班', '周5第4节', '雷春波', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (978, 1, '4年1班', '周5第5节', '李美琴', '综合实践', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (979, 2, '4年1班', '周5第5节', '郭霄涵', '心理健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (980, 0, '4年1班', '周5第6节', '吴剑军', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (981, 0, '4年1班', '周5第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (982, 0, '4年2班', '周1第1节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (983, 0, '4年2班', '周1第2节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (984, 0, '4年2班', '周1第3节', '黄静', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (985, 0, '4年2班', '周1第4节', '龙爱科', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (986, 0, '4年2班', '周1第5节', '杨浩阳', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (987, 0, '4年2班', '周1第6节', '刘佳佳', '劳动', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (988, 0, '4年2班', '周1第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (989, 0, '4年2班', '周2第1节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (990, 0, '4年2班', '周2第2节', '李美琴', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (991, 0, '4年2班', '周2第3节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (992, 0, '4年2班', '周2第4节', '李美琴', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (993, 0, '4年2班', '周2第5节', '钟敏', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (994, 0, '4年2班', '周2第6节', '邱奕斌', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (995, 0, '4年2班', '周2第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (996, 0, '4年2班', '周3第1节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (997, 0, '4年2班', '周3第2节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (998, 0, '4年2班', '周3第3节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (999, 0, '4年2班', '周3第4节', '钟敏', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1000, 1, '4年2班', '周3第5节', '郭霄涵', '心理健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1001, 2, '4年2班', '周3第5节', '龙爱科', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1002, 0, '4年2班', '周3第6节', '吴剑军', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1003, 0, '4年2班', '周3第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1004, 0, '4年2班', '周4第1节', '李美琴', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1005, 0, '4年2班', '周4第2节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1006, 0, '4年2班', '周4第3节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1007, 0, '4年2班', '周4第4节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1008, 0, '4年2班', '周4第5节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1009, 0, '4年2班', '周4第6节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1010, 0, '4年2班', '周4第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1011, 0, '4年2班', '周5第1节', '黄静', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1012, 0, '4年2班', '周5第2节', '李美琴', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1013, 0, '4年2班', '周5第3节', '刘佳佳', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1014, 0, '4年2班', '周5第4节', '吴剑军', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1015, 1, '4年2班', '周5第5节', '杨浩阳', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1016, 2, '4年2班', '周5第5节', '李美琴', '综合实践', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1017, 0, '4年2班', '周5第6节', '邱奕斌', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1018, 0, '4年2班', '周5第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1019, 0, '4年3班', '周1第1节', '谭巧丽', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1020, 0, '4年3班', '周1第2节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1021, 0, '4年3班', '周1第3节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1022, 1, '4年3班', '周1第4节', '郭霄涵', '心理健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1023, 2, '4年3班', '周1第4节', '谭巧丽', '综合实践', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1024, 0, '4年3班', '周1第5节', '吴剑军', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1025, 0, '4年3班', '周1第6节', '谭巧丽', '劳动', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1026, 0, '4年3班', '周1第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1027, 0, '4年3班', '周2第1节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1028, 0, '4年3班', '周2第2节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1029, 0, '4年3班', '周2第3节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1030, 0, '4年3班', '周2第4节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1031, 0, '4年3班', '周2第5节', '邱奕斌', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1032, 1, '4年3班', '周2第6节', '吴芊芊', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1033, 2, '4年3班', '周2第6节', '杨浩阳', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1034, 0, '4年3班', '周2第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1035, 0, '4年3班', '周3第1节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1036, 0, '4年3班', '周3第2节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1037, 0, '4年3班', '周3第3节', '谭巧丽', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1038, 0, '4年3班', '周3第4节', '谭巧丽', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1039, 0, '4年3班', '周3第5节', '袁丹', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1040, 0, '4年3班', '周3第6节', '邱奕斌', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1041, 0, '4年3班', '周3第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1042, 0, '4年3班', '周4第1节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1043, 0, '4年3班', '周4第2节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1044, 0, '4年3班', '周4第3节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1045, 0, '4年3班', '周4第4节', '谭巧丽', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1046, 0, '4年3班', '周4第5节', '杨浩阳', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1047, 0, '4年3班', '周4第6节', '袁丹', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1048, 0, '4年3班', '周4第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1049, 0, '4年3班', '周5第1节', '谭巧丽', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1050, 0, '4年3班', '周5第2节', '钟敏', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1051, 0, '4年3班', '周5第3节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1052, 0, '4年3班', '周5第4节', '吴芊芊', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1053, 0, '4年3班', '周5第5节', '吴剑军', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1054, 0, '4年3班', '周5第6节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1055, 0, '4年3班', '周5第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1056, 0, '4年4班', '周1第1节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1057, 0, '4年4班', '周1第2节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1058, 0, '4年4班', '周1第3节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1059, 0, '4年4班', '周1第4节', '吴芊芊', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1060, 0, '4年4班', '周1第5节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1061, 0, '4年4班', '周1第6节', '赵接娣', '劳动', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1062, 0, '4年4班', '周1第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1063, 0, '4年4班', '周2第1节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1064, 0, '4年4班', '周2第2节', '谭巧丽', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1065, 0, '4年4班', '周2第3节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1066, 1, '4年4班', '周2第4节', '谭巧丽', '综合实践', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1067, 2, '4年4班', '周2第4节', '郭霄涵', '心理健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1068, 0, '4年4班', '周2第5节', '吴文博', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1069, 0, '4年4班', '周2第6节', '梁伟全', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1070, 0, '4年4班', '周2第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1071, 0, '4年4班', '周3第1节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1072, 0, '4年4班', '周3第2节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1073, 0, '4年4班', '周3第3节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1074, 0, '4年4班', '周3第4节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1075, 0, '4年4班', '周3第5节', '钟敏', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1076, 0, '4年4班', '周3第6节', '梁伟全', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1077, 0, '4年4班', '周3第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1078, 0, '4年4班', '周4第1节', '谭巧丽', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1079, 0, '4年4班', '周4第2节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1080, 0, '4年4班', '周4第3节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1081, 0, '4年4班', '周4第4节', '郑思越', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1082, 1, '4年4班', '周4第5节', '吴芊芊', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1083, 2, '4年4班', '周4第5节', '吴文博', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1084, 0, '4年4班', '周4第6节', '赵接娣', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1085, 0, '4年4班', '周4第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1086, 0, '4年4班', '周5第1节', '林摇', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1087, 0, '4年4班', '周5第2节', '谭巧丽', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1088, 0, '4年4班', '周5第3节', '赵接娣', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1089, 0, '4年4班', '周5第4节', '钟敏', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1090, 0, '4年4班', '周5第5节', '郑思越', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1091, 0, '4年4班', '周5第6节', '谭巧丽', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1092, 0, '4年4班', '周5第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1093, 0, '4年5班', '周1第1节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1094, 0, '4年5班', '周1第2节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1095, 0, '4年5班', '周1第3节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1096, 0, '4年5班', '周1第4节', '孙继云', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1097, 0, '4年5班', '周1第5节', '陈月儿', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1098, 0, '4年5班', '周1第6节', '胡蝶', '劳动', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1099, 0, '4年5班', '周1第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1100, 0, '4年5班', '周2第1节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1101, 0, '4年5班', '周2第2节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1102, 0, '4年5班', '周2第3节', '孙继云', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1103, 0, '4年5班', '周2第4节', '胡蝶', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1104, 1, '4年5班', '周2第5节', '郭霄涵', '心理健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1105, 2, '4年5班', '周2第5节', '陈伊玲', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1106, 0, '4年5班', '周2第6节', '郑思越', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1107, 0, '4年5班', '周2第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1108, 0, '4年5班', '周3第1节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1109, 0, '4年5班', '周3第2节', '孙继云', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1110, 0, '4年5班', '周3第3节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1111, 0, '4年5班', '周3第4节', '郑思越', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1112, 0, '4年5班', '周3第5节', '梁伟全', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1113, 0, '4年5班', '周3第6节', '陈伊玲', '美术', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1114, 0, '4年5班', '周3第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1115, 0, '4年5班', '周4第1节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1116, 0, '4年5班', '周4第2节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1117, 0, '4年5班', '周4第3节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1118, 0, '4年5班', '周4第4节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1119, 0, '4年5班', '周4第5节', '梁伟全', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1120, 0, '4年5班', '周4第6节', '吴文博', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1121, 0, '4年5班', '周4第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1122, 0, '4年5班', '周5第1节', '胡蝶', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1123, 0, '4年5班', '周5第2节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1124, 0, '4年5班', '周5第3节', '孙继云', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1125, 0, '4年5班', '周5第4节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1126, 1, '4年5班', '周5第5节', '孙继云', '综合实践', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1127, 2, '4年5班', '周5第5节', '吴文博', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1128, 0, '4年5班', '周5第6节', '陈月儿', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1129, 0, '4年5班', '周5第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1130, 0, '4年6班', '周1第1节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1131, 0, '4年6班', '周1第2节', '孙继云', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1132, 0, '4年6班', '周1第3节', '王红', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1133, 0, '4年6班', '周1第4节', '李灵', '信技', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1134, 0, '4年6班', '周1第5节', '孙继云', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1135, 0, '4年6班', '周1第6节', '张文鑫', '劳动', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1136, 0, '4年6班', '周1第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1137, 0, '4年6班', '周2第1节', '曾雪莲', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1138, 0, '4年6班', '周2第2节', '曾雪莲', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1139, 0, '4年6班', '周2第3节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1140, 0, '4年6班', '周2第4节', '梁伟全', '体育与健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1141, 0, '4年6班', '周2第5节', '郑思越', '科学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1142, 1, '4年6班', '周2第6节', '王红', '音乐', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1143, 2, '4年6班', '周2第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1144, 0, '4年6班', '周2第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1145, 0, '4年6班', '周3第1节', '孙继云', '英语', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1146, 0, '4年6班', '周3第2节', '张文鑫', '数学', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1147, 0, '4年6班', '周3第3节', '曾雪莲', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1148, 0, '4年6班', '周3第4节', '曾雪莲', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1149, 0, '4年6班', '周3第5节', '陈月儿', '道德与法治', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1150, 0, '4年6班', '周3第6节', '孙继云', '体育与健康2', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1151, 0, '4年6班', '周3第7节', NULL, NULL, '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1152, 0, '4年6班', '周4第1节', '曾雪莲', '语文', '2024-09-14 15:33:24', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1153, 0, '4年6班', '周4第2节', '曾雪莲', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1154, 0, '4年6班', '周4第3节', '张文鑫', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1155, 0, '4年6班', '周4第4节', '柳国嫦', '体育与健康1', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1156, 1, '4年6班', '周4第5节', '陈伊玲', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1157, 2, '4年6班', '周4第5节', '孙继云', '综合实践', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1158, 0, '4年6班', '周4第6节', '郑思越', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1159, 0, '4年6班', '周4第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1160, 0, '4年6班', '周5第1节', '张文鑫', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1161, 0, '4年6班', '周5第2节', '孙继云', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1162, 0, '4年6班', '周5第3节', '曾雪莲', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1163, 0, '4年6班', '周5第4节', '梁伟全', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1164, 0, '4年6班', '周5第5节', '陈月儿', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1165, 0, '4年6班', '周5第6节', '陈伊玲', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1166, 0, '4年6班', '周5第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1167, 0, '5年1班', '周1第1节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1168, 0, '5年1班', '周1第2节', '徐一玖', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1169, 0, '5年1班', '周1第3节', '李彩英', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1170, 0, '5年1班', '周1第4节', '李彩英', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1171, 0, '5年1班', '周1第5节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1172, 0, '5年1班', '周1第6节', '张小玲', '劳动', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1173, 0, '5年1班', '周1第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1174, 0, '5年1班', '周2第1节', '李彩英', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1175, 0, '5年1班', '周2第2节', '李彩英', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1176, 0, '5年1班', '周2第3节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1177, 0, '5年1班', '周2第4节', '卢龙云', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1178, 0, '5年1班', '周2第5节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1179, 0, '5年1班', '周2第6节', '吴文博', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1180, 0, '5年1班', '周2第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1181, 0, '5年1班', '周3第1节', '李彩英', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1182, 0, '5年1班', '周3第2节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1183, 0, '5年1班', '周3第3节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1184, 1, '5年1班', '周3第4节', '吴文博', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1185, 2, '5年1班', '周3第4节', '郭霄涵', '心理健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1186, 0, '5年1班', '周3第5节', '卢龙云', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1187, 0, '5年1班', '周3第6节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1188, 0, '5年1班', '周3第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1189, 0, '5年1班', '周4第1节', '徐一玖', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1190, 0, '5年1班', '周4第2节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1191, 0, '5年1班', '周4第3节', '李彩英', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1192, 1, '5年1班', '周4第4节', '徐一玖', '综合实践', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1193, 2, '5年1班', '周4第4节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1194, 0, '5年1班', '周4第5节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1195, 0, '5年1班', '周4第6节', '李彩英', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1196, 0, '5年1班', '周4第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1197, 0, '5年1班', '周5第1节', '李彩英', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1198, 0, '5年1班', '周5第2节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1199, 0, '5年1班', '周5第3节', '徐一玖', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1200, 0, '5年1班', '周5第4节', '刘广友', '信技', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1201, 0, '5年1班', '周5第5节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1202, 0, '5年1班', '周5第6节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1203, 0, '5年1班', '周5第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1204, 0, '5年2班', '周1第1节', '吴采怡', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1205, 0, '5年2班', '周1第2节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1206, 0, '5年2班', '周1第3节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1207, 0, '5年2班', '周1第4节', '吴采怡', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1208, 0, '5年2班', '周1第5节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1209, 0, '5年2班', '周1第6节', '吴采怡', '劳动', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1210, 0, '5年2班', '周1第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1211, 0, '5年2班', '周2第1节', '徐一玖', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1212, 0, '5年2班', '周2第2节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1213, 0, '5年2班', '周2第3节', '吴采怡', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1214, 0, '5年2班', '周2第4节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1215, 0, '5年2班', '周2第5节', '卢龙云', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1216, 0, '5年2班', '周2第6节', '刘广友', '信技', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1217, 0, '5年2班', '周2第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1218, 0, '5年2班', '周3第1节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1219, 0, '5年2班', '周3第2节', '徐一玖', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1220, 0, '5年2班', '周3第3节', '吴采怡', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1221, 0, '5年2班', '周3第4节', '吴采怡', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1222, 0, '5年2班', '周3第5节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1223, 1, '5年2班', '周3第6节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1224, 2, '5年2班', '周3第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1225, 0, '5年2班', '周3第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1226, 0, '5年2班', '周4第1节', '吴采怡', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1227, 0, '5年2班', '周4第2节', '吴采怡', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1228, 0, '5年2班', '周4第3节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1229, 0, '5年2班', '周4第4节', '卢龙云', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1230, 1, '5年2班', '周4第5节', '吴文博', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1231, 2, '5年2班', '周4第5节', '徐一玖', '综合实践', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1232, 0, '5年2班', '周4第6节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1233, 0, '5年2班', '周4第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1234, 0, '5年2班', '周5第1节', '吴采怡', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1235, 0, '5年2班', '周5第2节', '徐一玖', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1236, 0, '5年2班', '周5第3节', '张小玲', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1237, 0, '5年2班', '周5第4节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1238, 0, '5年2班', '周5第5节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1239, 0, '5年2班', '周5第6节', '吴文博', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1240, 0, '5年2班', '周5第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1241, 0, '5年3班', '周1第1节', '林曼', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1242, 0, '5年3班', '周1第2节', '张婷', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1243, 0, '5年3班', '周1第3节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1244, 0, '5年3班', '周1第4节', '林曼', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1245, 0, '5年3班', '周1第5节', '卢龙云', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1246, 0, '5年3班', '周1第6节', '林曼', '劳动', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1247, 0, '5年3班', '周1第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1248, 0, '5年3班', '周2第1节', '张婷', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1249, 0, '5年3班', '周2第2节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1250, 0, '5年3班', '周2第3节', '林曼', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1251, 0, '5年3班', '周2第4节', '吴文博', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1252, 0, '5年3班', '周2第5节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1253, 0, '5年3班', '周2第6节', '张婷', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1254, 0, '5年3班', '周2第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1255, 0, '5年3班', '周3第1节', '林曼', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1256, 0, '5年3班', '周3第2节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1257, 0, '5年3班', '周3第3节', '张婷', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1258, 0, '5年3班', '周3第4节', '张婷', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1259, 0, '5年3班', '周3第5节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1260, 1, '5年3班', '周3第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1261, 2, '5年3班', '周3第6节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1262, 0, '5年3班', '周3第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1263, 0, '5年3班', '周4第1节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1264, 0, '5年3班', '周4第2节', '张婷', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1265, 0, '5年3班', '周4第3节', '张婷', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1266, 0, '5年3班', '周4第4节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1267, 0, '5年3班', '周4第5节', '张婷', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1268, 0, '5年3班', '周4第6节', '林曼', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1269, 0, '5年3班', '周4第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1270, 0, '5年3班', '周5第1节', '张婷', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1271, 0, '5年3班', '周5第2节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1272, 0, '5年3班', '周5第3节', '卢龙云', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1273, 0, '5年3班', '周5第4节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1274, 1, '5年3班', '周5第5节', '吴文博', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1275, 2, '5年3班', '周5第5节', '林曼', '综合实践', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1276, 0, '5年3班', '周5第6节', '刘广友', '信技', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1277, 0, '5年3班', '周5第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1278, 0, '5年4班', '周1第1节', '林晓青', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1279, 0, '5年4班', '周1第2节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1280, 0, '5年4班', '周1第3节', '刘广友', '信技', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1281, 0, '5年4班', '周1第4节', '王晴晴', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1282, 0, '5年4班', '周1第5节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1283, 0, '5年4班', '周1第6节', '林晓青', '劳动', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1284, 0, '5年4班', '周1第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1285, 0, '5年4班', '周2第1节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1286, 0, '5年4班', '周2第2节', '林曼', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1287, 0, '5年4班', '周2第3节', '林晓青', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1288, 0, '5年4班', '周2第4节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1289, 0, '5年4班', '周2第5节', '林晓青', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1290, 1, '5年4班', '周2第6节', '杨浩阳', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1291, 2, '5年4班', '周2第6节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1292, 0, '5年4班', '周2第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1293, 0, '5年4班', '周3第1节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1294, 0, '5年4班', '周3第2节', '林晓青', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1295, 0, '5年4班', '周3第3节', '林晓青', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1296, 0, '5年4班', '周3第4节', '王晴晴', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1297, 0, '5年4班', '周3第5节', '林晓青', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1298, 0, '5年4班', '周3第6节', '杨浩阳', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1299, 0, '5年4班', '周3第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1300, 0, '5年4班', '周4第1节', '林晓青', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1301, 0, '5年4班', '周4第2节', '林曼', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1302, 0, '5年4班', '周4第3节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1303, 1, '5年4班', '周4第4节', '林曼', '综合实践', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1304, 2, '5年4班', '周4第4节', '郭霄涵', '心理健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1305, 0, '5年4班', '周4第5节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1306, 0, '5年4班', '周4第6节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1307, 0, '5年4班', '周4第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1308, 0, '5年4班', '周5第1节', '林曼', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1309, 0, '5年4班', '周5第2节', '林晓青', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1310, 0, '5年4班', '周5第3节', '胡胜伟', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1311, 0, '5年4班', '周5第4节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1312, 0, '5年4班', '周5第5节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1313, 0, '5年4班', '周5第6节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1314, 0, '5年4班', '周5第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1315, 0, '5年5班', '周1第1节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1316, 0, '5年5班', '周1第2节', '董奕虹', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1317, 0, '5年5班', '周1第3节', '董奕虹', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1318, 0, '5年5班', '周1第4节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1319, 0, '5年5班', '周1第5节', '董奕虹', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1320, 0, '5年5班', '周1第6节', '叶丽娇', '劳动', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1321, 0, '5年5班', '周1第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1322, 0, '5年5班', '周2第1节', '董奕虹', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1323, 0, '5年5班', '周2第2节', '罗丽娜', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1324, 0, '5年5班', '周2第3节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1325, 0, '5年5班', '周2第4节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1326, 0, '5年5班', '周2第5节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1327, 0, '5年5班', '周2第6节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1328, 0, '5年5班', '周2第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1329, 0, '5年5班', '周3第1节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1330, 0, '5年5班', '周3第2节', '罗丽娜', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1331, 0, '5年5班', '周3第3节', '董奕虹', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1332, 0, '5年5班', '周3第4节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1333, 1, '5年5班', '周3第5节', '吴芊芊', '美术', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1334, 2, '5年5班', '周3第5节', '杨浩阳', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1335, 0, '5年5班', '周3第6节', '王晴晴', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1336, 0, '5年5班', '周3第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1337, 0, '5年5班', '周4第1节', '罗丽娜', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1338, 0, '5年5班', '周4第2节', '董奕虹', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1339, 0, '5年5班', '周4第3节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1340, 0, '5年5班', '周4第4节', '何珊', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1341, 0, '5年5班', '周4第5节', '陈智明', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1342, 0, '5年5班', '周4第6节', '刘广友', '信技', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1343, 0, '5年5班', '周4第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1344, 0, '5年5班', '周5第1节', '董奕虹', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1345, 0, '5年5班', '周5第2节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1346, 1, '5年5班', '周5第3节', '罗丽娜', '综合实践', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1347, 2, '5年5班', '周5第3节', '郭霄涵', '心理健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1348, 0, '5年5班', '周5第4节', '王晴晴', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1349, 0, '5年5班', '周5第5节', '罗丽娜', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1350, 0, '5年5班', '周5第6节', '杨浩阳', '音乐', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1351, 0, '5年5班', '周5第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1352, 0, '5年6班', '周1第1节', '戴雪祥', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1353, 0, '5年6班', '周1第2节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1354, 0, '5年6班', '周1第3节', '罗丽娜', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1355, 0, '5年6班', '周1第4节', '刘广友', '信技', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1356, 0, '5年6班', '周1第5节', '罗丽娜', '体育与健康2', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1357, 0, '5年6班', '周1第6节', '戴雪祥', '劳动', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1358, 0, '5年6班', '周1第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1359, 0, '5年6班', '周2第1节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1360, 0, '5年6班', '周2第2节', '戴雪祥', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1361, 0, '5年6班', '周2第3节', '罗丽娜', '英语', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1362, 0, '5年6班', '周2第4节', '王晴晴', '科学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1363, 0, '5年6班', '周2第5节', '梁伟全', '体育与健康', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1364, 0, '5年6班', '周2第6节', '戴雪祥', '道德与法治', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1365, 0, '5年6班', '周2第7节', NULL, NULL, '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1366, 0, '5年6班', '周3第1节', '戴雪祥', '语文', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1367, 0, '5年6班', '周3第2节', '叶丽娇', '数学', '2024-09-14 15:33:25', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1368, 0, '5年6班', '周3第3节', '戴雪祥', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1369, 1, '5年6班', '周3第4节', '杨浩阳', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1370, 2, '5年6班', '周3第4节', '吴芊芊', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1371, 0, '5年6班', '周3第5节', '戴雪祥', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1372, 0, '5年6班', '周3第6节', '罗丽娜', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1373, 0, '5年6班', '周3第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1374, 0, '5年6班', '周4第1节', '叶丽娇', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1375, 0, '5年6班', '周4第2节', '戴雪祥', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1376, 0, '5年6班', '周4第3节', '戴雪祥', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1377, 0, '5年6班', '周4第4节', '梁伟全', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1378, 0, '5年6班', '周4第5节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1379, 0, '5年6班', '周4第6节', '吴芊芊', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1380, 0, '5年6班', '周4第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1381, 0, '5年6班', '周5第1节', '罗丽娜', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1382, 0, '5年6班', '周5第2节', '戴雪祥', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1383, 0, '5年6班', '周5第3节', '叶丽娇', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1384, 0, '5年6班', '周5第4节', '杨浩阳', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1385, 0, '5年6班', '周5第5节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1386, 1, '5年6班', '周5第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1387, 2, '5年6班', '周5第6节', '罗丽娜', '综合实践', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1388, 0, '5年6班', '周5第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1389, 0, '6年1班', '周1第1节', '张舒婷', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1390, 0, '6年1班', '周1第2节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1391, 0, '6年1班', '周1第3节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1392, 0, '6年1班', '周1第4节', '张舒婷', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1393, 0, '6年1班', '周1第5节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1394, 0, '6年1班', '周1第6节', '张舒婷', '劳动', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1395, 0, '6年1班', '周1第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1396, 0, '6年1班', '周2第1节', '彭惠敏', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1397, 0, '6年1班', '周2第2节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1398, 0, '6年1班', '周2第3节', '张舒婷', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1399, 0, '6年1班', '周2第4节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1400, 0, '6年1班', '周2第5节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1401, 0, '6年1班', '周2第6节', '张舒婷', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1402, 0, '6年1班', '周2第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1403, 0, '6年1班', '周3第1节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1404, 0, '6年1班', '周3第2节', '彭惠敏', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1405, 0, '6年1班', '周3第3节', '张舒婷', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1406, 0, '6年1班', '周3第4节', '张舒婷', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1407, 1, '6年1班', '周3第5节', '张舒婷', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1408, 2, '6年1班', '周3第5节', '郭霄涵', '心理健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1409, 0, '6年1班', '周3第6节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1410, 0, '6年1班', '周3第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1411, 0, '6年1班', '周4第1节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1412, 0, '6年1班', '周4第2节', '张舒婷', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1413, 0, '6年1班', '周4第3节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1414, 1, '6年1班', '周4第4节', '彭惠敏', '综合实践', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1415, 2, '6年1班', '周4第4节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1416, 0, '6年1班', '周4第5节', '刘广友', '信技', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1417, 0, '6年1班', '周4第6节', '张舒婷', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1418, 0, '6年1班', '周4第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1419, 0, '6年1班', '周5第1节', '张舒婷', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1420, 0, '6年1班', '周5第2节', '彭惠敏', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1421, 0, '6年1班', '周5第3节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1422, 0, '6年1班', '周5第4节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1423, 0, '6年1班', '周5第5节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1424, 0, '6年1班', '周5第6节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1425, 0, '6年1班', '周5第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1426, 0, '6年2班', '周1第1节', '黄石秀', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1427, 0, '6年2班', '周1第2节', '彭惠敏', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1428, 0, '6年2班', '周1第3节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1429, 0, '6年2班', '周1第4节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1430, 0, '6年2班', '周1第5节', '刘广友', '信技', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1431, 0, '6年2班', '周1第6节', '黄石秀', '劳动', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1432, 0, '6年2班', '周1第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1433, 0, '6年2班', '周2第1节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1434, 0, '6年2班', '周2第2节', '黄石秀', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1435, 1, '6年2班', '周2第3节', '郭霄涵', '心理健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1436, 2, '6年2班', '周2第3节', '黄石秀', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1437, 0, '6年2班', '周2第4节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1438, 0, '6年2班', '周2第5节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1439, 0, '6年2班', '周2第6节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1440, 0, '6年2班', '周2第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1441, 0, '6年2班', '周3第1节', '黄石秀', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1442, 0, '6年2班', '周3第2节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1443, 0, '6年2班', '周3第3节', '黄石秀', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1444, 0, '6年2班', '周3第4节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1445, 1, '6年2班', '周3第5节', '龙爱科', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1446, 2, '6年2班', '周3第5节', '彭惠敏', '综合实践', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1447, 0, '6年2班', '周3第6节', '黄石秀', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1448, 0, '6年2班', '周3第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1449, 0, '6年2班', '周4第1节', '彭惠敏', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1450, 0, '6年2班', '周4第2节', '黄石秀', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1451, 0, '6年2班', '周4第3节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1452, 0, '6年2班', '周4第4节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1453, 0, '6年2班', '周4第5节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1454, 0, '6年2班', '周4第6节', '黄石秀', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1455, 0, '6年2班', '周4第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1456, 0, '6年2班', '周5第1节', '周新萍', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1457, 0, '6年2班', '周5第2节', '黄石秀', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1458, 0, '6年2班', '周5第3节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1459, 0, '6年2班', '周5第4节', '黄石秀', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1460, 0, '6年2班', '周5第5节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1461, 0, '6年2班', '周5第6节', '彭惠敏', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1462, 0, '6年2班', '周5第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1463, 0, '6年3班', '周1第1节', '杨敏敏', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1464, 0, '6年3班', '周1第2节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1465, 1, '6年3班', '周1第3节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1466, 2, '6年3班', '周1第3节', '郭霄涵', '心理健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1467, 0, '6年3班', '周1第4节', '杨敏敏', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1468, 0, '6年3班', '周1第5节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1469, 0, '6年3班', '周1第6节', '杨敏敏', '劳动', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1470, 0, '6年3班', '周1第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1471, 0, '6年3班', '周2第1节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1472, 0, '6年3班', '周2第2节', '杨敏敏', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1473, 0, '6年3班', '周2第3节', '杨敏敏', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1474, 0, '6年3班', '周2第4节', '钟小娥', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1475, 0, '6年3班', '周2第5节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1476, 0, '6年3班', '周2第6节', '杨敏敏', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1477, 0, '6年3班', '周2第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1478, 0, '6年3班', '周3第1节', '钟小娥', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1479, 0, '6年3班', '周3第2节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1480, 0, '6年3班', '周3第3节', '杨敏敏', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1481, 0, '6年3班', '周3第4节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1482, 1, '6年3班', '周3第5节', '钟小娥', '综合实践', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1483, 2, '6年3班', '周3第5节', '杨敏敏', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1484, 0, '6年3班', '周3第6节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1485, 0, '6年3班', '周3第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1486, 0, '6年3班', '周4第1节', '杨敏敏', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1487, 0, '6年3班', '周4第2节', '钟小娥', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1488, 0, '6年3班', '周4第3节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1489, 0, '6年3班', '周4第4节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1490, 0, '6年3班', '周4第5节', '黄鸿凯', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1491, 0, '6年3班', '周4第6节', '陈月儿', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1492, 0, '6年3班', '周4第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1493, 0, '6年3班', '周5第1节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1494, 0, '6年3班', '周5第2节', '杨敏敏', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1495, 0, '6年3班', '周5第3节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1496, 0, '6年3班', '周5第4节', '杨敏敏', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1497, 0, '6年3班', '周5第5节', '刘广友', '信技', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1498, 0, '6年3班', '周5第6节', '王晴晴', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1499, 0, '6年3班', '周5第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1500, 0, '6年4班', '周1第1节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1501, 0, '6年4班', '周1第2节', '杨继红', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1502, 0, '6年4班', '周1第3节', '钟小娥', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1503, 0, '6年4班', '周1第4节', '杨继红', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1504, 0, '6年4班', '周1第5节', '梁伟全', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1505, 0, '6年4班', '周1第6节', '叶嘉舒', '劳动', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1506, 0, '6年4班', '周1第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1507, 0, '6年4班', '周2第1节', '杨继红', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1508, 0, '6年4班', '周2第2节', '钟小娥', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1509, 0, '6年4班', '周2第3节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1510, 0, '6年4班', '周2第4节', '王红', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1511, 0, '6年4班', '周2第5节', '杨继红', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1512, 0, '6年4班', '周2第6节', '周新萍', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1513, 0, '6年4班', '周2第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1514, 0, '6年4班', '周3第1节', '杨继红', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1515, 0, '6年4班', '周3第2节', '杨继红', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1516, 0, '6年4班', '周3第3节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1517, 0, '6年4班', '周3第4节', '刘广友', '信技', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1518, 0, '6年4班', '周3第5节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1519, 1, '6年3班', '周3第5节', '王红', '音乐', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1520, 2, '6年3班', '周3第5节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1521, 0, '6年4班', '周3第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1522, 0, '6年4班', '周4第1节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1523, 0, '6年4班', '周4第2节', '杨继红', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1524, 0, '6年4班', '周4第3节', '杨继红', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1525, 1, '6年4班', '周4第4节', '郭霄涵', '心理健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1526, 2, '6年4班', '周4第4节', '钟小娥', '综合实践', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1527, 0, '6年4班', '周4第5节', '邱奕斌', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1528, 0, '6年4班', '周4第6节', '钟小娥', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1529, 0, '6年4班', '周4第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1530, 0, '6年4班', '周5第1节', '钟小娥', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1531, 0, '6年4班', '周5第2节', '叶嘉舒', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1532, 0, '6年4班', '周5第3节', '杨继红', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1533, 0, '6年4班', '周5第4节', '邱奕斌', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1534, 0, '6年4班', '周5第5节', '梁伟全', '体育与健康', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1535, 0, '6年4班', '周5第6节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1536, 0, '6年4班', '周5第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1537, 0, '6年5班', '周1第1节', '曹丽平', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1538, 0, '6年5班', '周1第2节', '张友愉', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1539, 0, '6年5班', '周1第3节', '邱奕斌', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1540, 0, '6年5班', '周1第4节', '曹丽平', '体育与健康2', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1541, 0, '6年5班', '周1第5节', '杨继红', '道德与法治', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1542, 0, '6年5班', '周1第6节', '曹丽平', '劳动', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1543, 0, '6年5班', '周1第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1544, 0, '6年5班', '周2第1节', '郑定中', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1545, 0, '6年5班', '周2第2节', '曹丽平', '英语', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1546, 0, '6年5班', '周2第3节', '张友愉', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1547, 0, '6年5班', '周2第4节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1548, 0, '6年5班', '周2第5节', '刘广友', '信技', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1549, 0, '6年5班', '周2第6节', '龙爱科', '美术', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1550, 0, '6年5班', '周2第7节', NULL, NULL, '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1551, 0, '6年5班', '周3第1节', '张友愉', '数学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1552, 0, '6年5班', '周3第2节', '郑定中', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1553, 0, '6年5班', '周3第3节', '郑定中', '语文', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1554, 0, '6年5班', '周3第4节', '邱奕斌', '科学', '2024-09-14 15:33:26', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1555, 0, '6年5班', '周3第5节', '吴剑军', '体育与健康', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1556, 1, '6年5班', '周3第6节', '龙爱科', '美术', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1557, 2, '6年5班', '周3第6节', '王红', '音乐', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1558, 0, '6年5班', '周3第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1559, 0, '6年5班', '周4第1节', '曹丽平', '英语', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1560, 0, '6年5班', '周4第2节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1561, 0, '6年5班', '周4第3节', '郑定中', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1562, 0, '6年5班', '周4第4节', '吴剑军', '体育与健康', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1563, 0, '6年5班', '周4第5节', '杨继红', '道德与法治', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1564, 0, '6年5班', '周4第6节', '王红', '音乐', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1565, 0, '6年5班', '周4第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1566, 0, '6年5班', '周5第1节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1567, 0, '6年5班', '周5第2节', '郑定中', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1568, 0, '6年5班', '周5第3节', '郑定中', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1569, 0, '6年5班', '周5第4节', '杨继红', '道德与法治', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1570, 0, '6年5班', '周5第5节', '曹丽平', '体育与健康2', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1571, 1, '6年5班', '周5第6节', '曹丽平', '综合实践', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1572, 2, '6年5班', '周5第6节', '郭霄涵', '心理健康', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1573, 0, '6年5班', '周5第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1574, 0, '6年6班', '周1第1节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1575, 0, '6年6班', '周1第2节', '邱奕斌', '科学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1576, 1, '6年6班', '周1第3节', '郭霄涵', '心理健康', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1577, 2, '6年6班', '周1第3节', '龙爱科', '美术', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1578, 0, '6年6班', '周1第4节', '陈月儿', '道德与法治', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1579, 0, '6年6班', '周1第5节', '周新萍', '体育与健康2', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1580, 0, '6年6班', '周1第6节', '张友愉', '劳动', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1581, 0, '6年6班', '周1第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1582, 0, '6年6班', '周2第1节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1583, 0, '6年6班', '周2第2节', '胡慧', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1584, 0, '6年6班', '周2第3节', '胡慧', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1585, 0, '6年6班', '周2第4节', '曹丽平', '英语', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1586, 0, '6年6班', '周2第5节', '吴剑军', '体育与健康', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1587, 0, '6年6班', '周2第6节', '陈月儿', '道德与法治', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1588, 0, '6年6班', '周2第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1589, 0, '6年6班', '周3第1节', '胡慧', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1590, 0, '6年6班', '周3第2节', '曹丽平', '英语', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1591, 0, '6年6班', '周3第3节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1592, 0, '6年6班', '周3第4节', '吴剑军', '体育与健康', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1593, 1, '6年6班', '周3第5节', '曹丽平', '综合实践', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1594, 2, '6年6班', '周3第5节', '王红', '音乐', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1595, 0, '6年6班', '周3第6节', '刘广友', '信技', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1596, 0, '6年6班', '周3第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1597, 0, '6年6班', '周4第1节', '胡慧', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1598, 0, '6年6班', '周4第2节', '胡慧', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1599, 0, '6年6班', '周4第3节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1600, 0, '6年6班', '周4第4节', '邱奕斌', '科学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1601, 0, '6年6班', '周4第5节', '陈月儿', '道德与法治', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1602, 0, '6年6班', '周4第6节', '曹丽平', '体育与健康2', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1603, 0, '6年6班', '周4第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1604, 0, '6年6班', '周5第1节', '曹丽平', '英语', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1605, 0, '6年6班', '周5第2节', '张友愉', '数学', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1606, 0, '6年6班', '周5第3节', '胡慧', '语文', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1607, 0, '6年6班', '周5第4节', '龙爱科', '美术', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1608, 0, '6年6班', '周5第5节', '王红', '音乐', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1609, 0, '6年6班', '周5第6节', '丘耀斌', '体育与健康1', '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);
INSERT INTO `class_schedule` VALUES (1610, 0, '6年6班', '周5第7节', NULL, NULL, '2024-09-14 15:33:27', '2024-09-13 17:51:48', 0);

-- ----------------------------
-- Table structure for gen_table
-- ----------------------------
DROP TABLE IF EXISTS `gen_table`;
CREATE TABLE `gen_table`  (
  `table_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `table_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '表名称',
  `table_comment` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '表描述',
  `sub_table_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '关联子表的表名',
  `sub_table_fk_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '子表关联的外键名',
  `class_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '实体类名称',
  `tpl_category` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'crud' COMMENT '使用的模板（crud单表操作 tree树表操作）',
  `tpl_web_type` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '前端模板类型（element-ui模版 element-plus模版）',
  `package_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成包路径',
  `module_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成模块名',
  `business_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成业务名',
  `function_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成功能名',
  `function_author` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成功能作者',
  `gen_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '生成代码方式（0zip压缩包 1自定义路径）',
  `gen_path` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '/' COMMENT '生成路径（不填默认项目路径）',
  `options` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '其它生成选项',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`table_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '代码生成业务表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of gen_table
-- ----------------------------
INSERT INTO `gen_table` VALUES (1, 'class_schedule', '课表', NULL, NULL, 'ClassSchedule', 'crud', 'element-plus', 'com.fxcourse.classschedule', 'classschedule', 'classschedule', 'fx课表', 'fming', '0', '/', '{\"parentMenuId\":0}', 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45', NULL);

-- ----------------------------
-- Table structure for gen_table_column
-- ----------------------------
DROP TABLE IF EXISTS `gen_table_column`;
CREATE TABLE `gen_table_column`  (
  `column_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `table_id` bigint(20) NULL DEFAULT NULL COMMENT '归属表编号',
  `column_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '列名称',
  `column_comment` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '列描述',
  `column_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '列类型',
  `java_type` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'JAVA类型',
  `java_field` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'JAVA字段名',
  `is_pk` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否主键（1是）',
  `is_increment` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否自增（1是）',
  `is_required` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否必填（1是）',
  `is_insert` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否为插入字段（1是）',
  `is_edit` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否编辑字段（1是）',
  `is_list` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否列表字段（1是）',
  `is_query` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否查询字段（1是）',
  `query_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'EQ' COMMENT '查询方式（等于、不等于、大于、小于、范围）',
  `html_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '显示类型（文本框、文本域、下拉框、复选框、单选框、日期控件）',
  `dict_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典类型',
  `sort` int(11) NULL DEFAULT NULL COMMENT '排序',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`column_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '代码生成业务表字段' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of gen_table_column
-- ----------------------------
INSERT INTO `gen_table_column` VALUES (1, 1, 'id', '课程id', 'int(11) unsigned', 'Integer', 'id', '1', '1', '0', '0', NULL, '0', '0', 'EQ', 'input', '', 1, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (2, 1, 'single_double_week', '单双周课程', 'int(11)', 'Integer', 'singleDoubleWeek', '0', '0', '1', '1', '1', '1', '1', 'EQ', 'select', 'course_week_type', 2, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (3, 1, 'class_id', '班级', 'varchar(32)', 'String', 'classId', '0', '0', '1', '1', '1', '1', '1', 'EQ', 'select', 'course_class', 3, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (4, 1, 'class_hour_id', '课时', 'varchar(32)', 'String', 'classHourId', '0', '0', '1', '1', '1', '1', '1', 'LIKE', 'input', '', 4, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (5, 1, 'teacher_id', '老师', 'varchar(32)', 'String', 'teacherId', '0', '0', '1', '1', '1', '1', '1', 'LIKE', 'input', '', 5, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (6, 1, 'subject_id', '科目', 'varchar(32)', 'String', 'subjectId', '0', '0', '1', '1', '1', '1', '1', 'LIKE', 'input', '', 6, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (7, 1, 'modify_time', '修改时间', 'timestamp', 'Date', 'modifyTime', '0', '0', '0', '0', '0', '1', '0', 'EQ', 'datetime', '', 7, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (8, 1, 'create_time', '创建时间', 'timestamp', 'Date', 'createTime', '0', '0', '0', '0', NULL, '0', '0', 'EQ', 'datetime', '', 8, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');
INSERT INTO `gen_table_column` VALUES (9, 1, 'deleted', '是否删除', 'tinyint(1)', 'Integer', 'deleted', '0', '0', '0', '0', '1', '1', '1', 'EQ', 'input', '', 9, 'admin', '2024-10-07 10:59:27', '', '2024-10-09 11:15:45');

-- ----------------------------
-- Table structure for qrtz_blob_triggers
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_blob_triggers`;
CREATE TABLE `qrtz_blob_triggers`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `trigger_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_name的外键',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_group的外键',
  `blob_data` blob NULL COMMENT '存放持久化Trigger对象',
  PRIMARY KEY (`sched_name`, `trigger_name`, `trigger_group`) USING BTREE,
  CONSTRAINT `qrtz_blob_triggers_ibfk_1` FOREIGN KEY (`sched_name`, `trigger_name`, `trigger_group`) REFERENCES `qrtz_triggers` (`sched_name`, `trigger_name`, `trigger_group`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = 'Blob类型的触发器表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_blob_triggers
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_calendars
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_calendars`;
CREATE TABLE `qrtz_calendars`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `calendar_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '日历名称',
  `calendar` blob NOT NULL COMMENT '存放持久化calendar对象',
  PRIMARY KEY (`sched_name`, `calendar_name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '日历信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_calendars
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_cron_triggers
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_cron_triggers`;
CREATE TABLE `qrtz_cron_triggers`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `trigger_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_name的外键',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_group的外键',
  `cron_expression` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'cron表达式',
  `time_zone_id` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '时区',
  PRIMARY KEY (`sched_name`, `trigger_name`, `trigger_group`) USING BTREE,
  CONSTRAINT `qrtz_cron_triggers_ibfk_1` FOREIGN KEY (`sched_name`, `trigger_name`, `trigger_group`) REFERENCES `qrtz_triggers` (`sched_name`, `trigger_name`, `trigger_group`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = 'Cron类型的触发器表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_cron_triggers
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_fired_triggers
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_fired_triggers`;
CREATE TABLE `qrtz_fired_triggers`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `entry_id` varchar(95) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度器实例id',
  `trigger_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_name的外键',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_group的外键',
  `instance_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度器实例名',
  `fired_time` bigint(13) NOT NULL COMMENT '触发的时间',
  `sched_time` bigint(13) NOT NULL COMMENT '定时器制定的时间',
  `priority` int(11) NOT NULL COMMENT '优先级',
  `state` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '状态',
  `job_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '任务名称',
  `job_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '任务组名',
  `is_nonconcurrent` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否并发',
  `requests_recovery` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否接受恢复执行',
  PRIMARY KEY (`sched_name`, `entry_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '已触发的触发器表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_fired_triggers
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_job_details
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_job_details`;
CREATE TABLE `qrtz_job_details`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `job_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务名称',
  `job_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务组名',
  `description` varchar(250) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '相关介绍',
  `job_class_name` varchar(250) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '执行任务类名称',
  `is_durable` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '是否持久化',
  `is_nonconcurrent` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '是否并发',
  `is_update_data` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '是否更新数据',
  `requests_recovery` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '是否接受恢复执行',
  `job_data` blob NULL COMMENT '存放持久化job对象',
  PRIMARY KEY (`sched_name`, `job_name`, `job_group`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '任务详细信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_job_details
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_locks
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_locks`;
CREATE TABLE `qrtz_locks`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `lock_name` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '悲观锁名称',
  PRIMARY KEY (`sched_name`, `lock_name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '存储的悲观锁信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_locks
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_paused_trigger_grps
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_paused_trigger_grps`;
CREATE TABLE `qrtz_paused_trigger_grps`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_group的外键',
  PRIMARY KEY (`sched_name`, `trigger_group`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '暂停的触发器表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_paused_trigger_grps
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_scheduler_state
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_scheduler_state`;
CREATE TABLE `qrtz_scheduler_state`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `instance_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '实例名称',
  `last_checkin_time` bigint(13) NOT NULL COMMENT '上次检查时间',
  `checkin_interval` bigint(13) NOT NULL COMMENT '检查间隔时间',
  PRIMARY KEY (`sched_name`, `instance_name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '调度器状态表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_scheduler_state
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_simple_triggers
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_simple_triggers`;
CREATE TABLE `qrtz_simple_triggers`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `trigger_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_name的外键',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_group的外键',
  `repeat_count` bigint(7) NOT NULL COMMENT '重复的次数统计',
  `repeat_interval` bigint(12) NOT NULL COMMENT '重复的间隔时间',
  `times_triggered` bigint(10) NOT NULL COMMENT '已经触发的次数',
  PRIMARY KEY (`sched_name`, `trigger_name`, `trigger_group`) USING BTREE,
  CONSTRAINT `qrtz_simple_triggers_ibfk_1` FOREIGN KEY (`sched_name`, `trigger_name`, `trigger_group`) REFERENCES `qrtz_triggers` (`sched_name`, `trigger_name`, `trigger_group`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '简单触发器的信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_simple_triggers
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_simprop_triggers
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_simprop_triggers`;
CREATE TABLE `qrtz_simprop_triggers`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `trigger_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_name的外键',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_triggers表trigger_group的外键',
  `str_prop_1` varchar(512) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'String类型的trigger的第一个参数',
  `str_prop_2` varchar(512) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'String类型的trigger的第二个参数',
  `str_prop_3` varchar(512) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'String类型的trigger的第三个参数',
  `int_prop_1` int(11) NULL DEFAULT NULL COMMENT 'int类型的trigger的第一个参数',
  `int_prop_2` int(11) NULL DEFAULT NULL COMMENT 'int类型的trigger的第二个参数',
  `long_prop_1` bigint(20) NULL DEFAULT NULL COMMENT 'long类型的trigger的第一个参数',
  `long_prop_2` bigint(20) NULL DEFAULT NULL COMMENT 'long类型的trigger的第二个参数',
  `dec_prop_1` decimal(13, 4) NULL DEFAULT NULL COMMENT 'decimal类型的trigger的第一个参数',
  `dec_prop_2` decimal(13, 4) NULL DEFAULT NULL COMMENT 'decimal类型的trigger的第二个参数',
  `bool_prop_1` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'Boolean类型的trigger的第一个参数',
  `bool_prop_2` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'Boolean类型的trigger的第二个参数',
  PRIMARY KEY (`sched_name`, `trigger_name`, `trigger_group`) USING BTREE,
  CONSTRAINT `qrtz_simprop_triggers_ibfk_1` FOREIGN KEY (`sched_name`, `trigger_name`, `trigger_group`) REFERENCES `qrtz_triggers` (`sched_name`, `trigger_name`, `trigger_group`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '同步机制的行锁表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_simprop_triggers
-- ----------------------------

-- ----------------------------
-- Table structure for qrtz_triggers
-- ----------------------------
DROP TABLE IF EXISTS `qrtz_triggers`;
CREATE TABLE `qrtz_triggers`  (
  `sched_name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调度名称',
  `trigger_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '触发器的名字',
  `trigger_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '触发器所属组的名字',
  `job_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_job_details表job_name的外键',
  `job_group` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'qrtz_job_details表job_group的外键',
  `description` varchar(250) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '相关介绍',
  `next_fire_time` bigint(13) NULL DEFAULT NULL COMMENT '上一次触发时间（毫秒）',
  `prev_fire_time` bigint(13) NULL DEFAULT NULL COMMENT '下一次触发时间（默认为-1表示不触发）',
  `priority` int(11) NULL DEFAULT NULL COMMENT '优先级',
  `trigger_state` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '触发器状态',
  `trigger_type` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '触发器的类型',
  `start_time` bigint(13) NOT NULL COMMENT '开始时间',
  `end_time` bigint(13) NULL DEFAULT NULL COMMENT '结束时间',
  `calendar_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '日程表名称',
  `misfire_instr` smallint(2) NULL DEFAULT NULL COMMENT '补偿执行的策略',
  `job_data` blob NULL COMMENT '存放持久化job对象',
  PRIMARY KEY (`sched_name`, `trigger_name`, `trigger_group`) USING BTREE,
  INDEX `sched_name`(`sched_name` ASC, `job_name` ASC, `job_group` ASC) USING BTREE,
  CONSTRAINT `qrtz_triggers_ibfk_1` FOREIGN KEY (`sched_name`, `job_name`, `job_group`) REFERENCES `qrtz_job_details` (`sched_name`, `job_name`, `job_group`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '触发器详细信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qrtz_triggers
-- ----------------------------

-- ----------------------------
-- Table structure for sys_config
-- ----------------------------
DROP TABLE IF EXISTS `sys_config`;
CREATE TABLE `sys_config`  (
  `config_id` int(5) NOT NULL AUTO_INCREMENT COMMENT '参数主键',
  `config_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '参数名称',
  `config_key` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '参数键名',
  `config_value` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '参数键值',
  `config_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'N' COMMENT '系统内置（Y是 N否）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`config_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '参数配置表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_config
-- ----------------------------
INSERT INTO `sys_config` VALUES (1, '主框架页-默认皮肤样式名称', 'sys.index.skinName', 'skin-blue', 'Y', 'admin', '2024-10-07 10:26:53', '', NULL, '蓝色 skin-blue、绿色 skin-green、紫色 skin-purple、红色 skin-red、黄色 skin-yellow');
INSERT INTO `sys_config` VALUES (2, '用户管理-账号初始密码', 'sys.user.initPassword', '123456', 'Y', 'admin', '2024-10-07 10:26:53', '', NULL, '初始化密码 123456');
INSERT INTO `sys_config` VALUES (3, '主框架页-侧边栏主题', 'sys.index.sideTheme', 'theme-dark', 'Y', 'admin', '2024-10-07 10:26:53', '', NULL, '深色主题theme-dark，浅色主题theme-light');
INSERT INTO `sys_config` VALUES (4, '账号自助-验证码开关', 'sys.account.captchaEnabled', 'true', 'Y', 'admin', '2024-10-07 10:26:53', '', NULL, '是否开启验证码功能（true开启，false关闭）');
INSERT INTO `sys_config` VALUES (5, '账号自助-是否开启用户注册功能', 'sys.account.registerUser', 'false', 'Y', 'admin', '2024-10-07 10:26:53', '', NULL, '是否开启注册用户功能（true开启，false关闭）');
INSERT INTO `sys_config` VALUES (6, '用户登录-黑名单列表', 'sys.login.blackIPList', '', 'Y', 'admin', '2024-10-07 10:26:53', '', NULL, '设置登录IP黑名单限制，多个匹配项以;分隔，支持匹配（*通配、网段）');

-- ----------------------------
-- Table structure for sys_dept
-- ----------------------------
DROP TABLE IF EXISTS `sys_dept`;
CREATE TABLE `sys_dept`  (
  `dept_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '部门id',
  `parent_id` bigint(20) NULL DEFAULT 0 COMMENT '父部门id',
  `ancestors` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '祖级列表',
  `dept_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '部门名称',
  `order_num` int(4) NULL DEFAULT 0 COMMENT '显示顺序',
  `leader` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '负责人',
  `phone` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '联系电话',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '邮箱',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '部门状态（0正常 1停用）',
  `del_flag` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '删除标志（0代表存在 2代表删除）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`dept_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 200 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '部门表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dept
-- ----------------------------
INSERT INTO `sys_dept` VALUES (100, 0, '0', '若依科技', 0, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (101, 100, '0,100', '深圳总公司', 1, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (102, 100, '0,100', '长沙分公司', 2, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (103, 101, '0,100,101', '研发部门', 1, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (104, 101, '0,100,101', '市场部门', 2, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (105, 101, '0,100,101', '测试部门', 3, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (106, 101, '0,100,101', '财务部门', 4, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (107, 101, '0,100,101', '运维部门', 5, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (108, 102, '0,100,102', '市场部门', 1, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);
INSERT INTO `sys_dept` VALUES (109, 102, '0,100,102', '财务部门', 2, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL);

-- ----------------------------
-- Table structure for sys_dict_data
-- ----------------------------
DROP TABLE IF EXISTS `sys_dict_data`;
CREATE TABLE `sys_dict_data`  (
  `dict_code` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '字典编码',
  `dict_sort` int(4) NULL DEFAULT 0 COMMENT '字典排序',
  `dict_label` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典标签',
  `dict_value` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典键值',
  `dict_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典类型',
  `css_class` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '样式属性（其他样式扩展）',
  `list_class` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '表格回显样式',
  `is_default` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'N' COMMENT '是否默认（Y是 N否）',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '状态（0正常 1停用）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`dict_code`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 106 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '字典数据表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dict_data
-- ----------------------------
INSERT INTO `sys_dict_data` VALUES (1, 1, '男', '0', 'sys_user_sex', '', '', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '性别男');
INSERT INTO `sys_dict_data` VALUES (2, 2, '女', '1', 'sys_user_sex', '', '', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '性别女');
INSERT INTO `sys_dict_data` VALUES (3, 3, '未知', '2', 'sys_user_sex', '', '', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '性别未知');
INSERT INTO `sys_dict_data` VALUES (4, 1, '显示', '0', 'sys_show_hide', '', 'primary', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '显示菜单');
INSERT INTO `sys_dict_data` VALUES (5, 2, '隐藏', '1', 'sys_show_hide', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '隐藏菜单');
INSERT INTO `sys_dict_data` VALUES (6, 1, '正常', '0', 'sys_normal_disable', '', 'primary', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (7, 2, '停用', '1', 'sys_normal_disable', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '停用状态');
INSERT INTO `sys_dict_data` VALUES (8, 1, '正常', '0', 'sys_job_status', '', 'primary', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (9, 2, '暂停', '1', 'sys_job_status', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '停用状态');
INSERT INTO `sys_dict_data` VALUES (10, 1, '默认', 'DEFAULT', 'sys_job_group', '', '', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '默认分组');
INSERT INTO `sys_dict_data` VALUES (11, 2, '系统', 'SYSTEM', 'sys_job_group', '', '', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '系统分组');
INSERT INTO `sys_dict_data` VALUES (12, 1, '是', 'Y', 'sys_yes_no', '', 'primary', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '系统默认是');
INSERT INTO `sys_dict_data` VALUES (13, 2, '否', 'N', 'sys_yes_no', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '系统默认否');
INSERT INTO `sys_dict_data` VALUES (14, 1, '通知', '1', 'sys_notice_type', '', 'warning', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '通知');
INSERT INTO `sys_dict_data` VALUES (15, 2, '公告', '2', 'sys_notice_type', '', 'success', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '公告');
INSERT INTO `sys_dict_data` VALUES (16, 1, '正常', '0', 'sys_notice_status', '', 'primary', 'Y', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (17, 2, '关闭', '1', 'sys_notice_status', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '关闭状态');
INSERT INTO `sys_dict_data` VALUES (18, 99, '其他', '0', 'sys_oper_type', '', 'info', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '其他操作');
INSERT INTO `sys_dict_data` VALUES (19, 1, '新增', '1', 'sys_oper_type', '', 'info', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '新增操作');
INSERT INTO `sys_dict_data` VALUES (20, 2, '修改', '2', 'sys_oper_type', '', 'info', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '修改操作');
INSERT INTO `sys_dict_data` VALUES (21, 3, '删除', '3', 'sys_oper_type', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '删除操作');
INSERT INTO `sys_dict_data` VALUES (22, 4, '授权', '4', 'sys_oper_type', '', 'primary', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '授权操作');
INSERT INTO `sys_dict_data` VALUES (23, 5, '导出', '5', 'sys_oper_type', '', 'warning', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '导出操作');
INSERT INTO `sys_dict_data` VALUES (24, 6, '导入', '6', 'sys_oper_type', '', 'warning', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '导入操作');
INSERT INTO `sys_dict_data` VALUES (25, 7, '强退', '7', 'sys_oper_type', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '强退操作');
INSERT INTO `sys_dict_data` VALUES (26, 8, '生成代码', '8', 'sys_oper_type', '', 'warning', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '生成操作');
INSERT INTO `sys_dict_data` VALUES (27, 9, '清空数据', '9', 'sys_oper_type', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '清空操作');
INSERT INTO `sys_dict_data` VALUES (28, 1, '成功', '0', 'sys_common_status', '', 'primary', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (29, 2, '失败', '1', 'sys_common_status', '', 'danger', 'N', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '停用状态');
INSERT INTO `sys_dict_data` VALUES (100, 1, '一（1）班', '1', 'course_class', NULL, 'default', 'N', '1', 'admin', '2024-10-07 16:10:00', '', NULL, NULL);
INSERT INTO `sys_dict_data` VALUES (101, 2, '一（2）班', '2', 'course_class', NULL, 'default', 'N', '1', 'admin', '2024-10-07 16:10:44', '', NULL, NULL);
INSERT INTO `sys_dict_data` VALUES (102, 3, '一（3）班', '3', 'course_class', NULL, 'default', 'N', '1', 'admin', '2024-10-07 16:16:48', 'admin', '2024-10-09 11:40:08', NULL);
INSERT INTO `sys_dict_data` VALUES (103, 1, '单周', '1', 'course_week_type', NULL, 'default', 'N', '0', 'admin', '2024-10-08 17:46:46', '', NULL, NULL);
INSERT INTO `sys_dict_data` VALUES (104, 2, '双周', '2', 'course_week_type', NULL, 'default', 'N', '0', 'admin', '2024-10-08 17:46:56', '', NULL, NULL);
INSERT INTO `sys_dict_data` VALUES (105, 0, '否', '0', 'course_week_type', NULL, 'default', 'N', '0', 'admin', '2024-10-09 10:53:40', '', NULL, NULL);

-- ----------------------------
-- Table structure for sys_dict_type
-- ----------------------------
DROP TABLE IF EXISTS `sys_dict_type`;
CREATE TABLE `sys_dict_type`  (
  `dict_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '字典主键',
  `dict_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典名称',
  `dict_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典类型',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '状态（0正常 1停用）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`dict_id`) USING BTREE,
  UNIQUE INDEX `dict_type`(`dict_type` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 102 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '字典类型表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dict_type
-- ----------------------------
INSERT INTO `sys_dict_type` VALUES (1, '用户性别', 'sys_user_sex', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '用户性别列表');
INSERT INTO `sys_dict_type` VALUES (2, '菜单状态', 'sys_show_hide', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '菜单状态列表');
INSERT INTO `sys_dict_type` VALUES (3, '系统开关', 'sys_normal_disable', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '系统开关列表');
INSERT INTO `sys_dict_type` VALUES (4, '任务状态', 'sys_job_status', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '任务状态列表');
INSERT INTO `sys_dict_type` VALUES (5, '任务分组', 'sys_job_group', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '任务分组列表');
INSERT INTO `sys_dict_type` VALUES (6, '系统是否', 'sys_yes_no', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '系统是否列表');
INSERT INTO `sys_dict_type` VALUES (7, '通知类型', 'sys_notice_type', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '通知类型列表');
INSERT INTO `sys_dict_type` VALUES (8, '通知状态', 'sys_notice_status', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '通知状态列表');
INSERT INTO `sys_dict_type` VALUES (9, '操作类型', 'sys_oper_type', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '操作类型列表');
INSERT INTO `sys_dict_type` VALUES (10, '系统状态', 'sys_common_status', '0', 'admin', '2024-10-07 10:26:53', '', NULL, '登录状态列表');
INSERT INTO `sys_dict_type` VALUES (100, '科目', 'course_subject', '0', 'admin', '2024-10-07 16:06:42', 'admin', '2024-10-07 16:06:59', '科目列表');
INSERT INTO `sys_dict_type` VALUES (101, '班级', 'course_class', '0', 'admin', '2024-10-07 16:08:56', '', NULL, '班级列表');
INSERT INTO `sys_dict_type` VALUES (102, '单双周类型', 'course_week_type', '0', 'admin', '2024-10-08 17:46:26', 'admin', '2024-10-08 17:47:13', '单双周类型');

-- ----------------------------
-- Table structure for sys_job
-- ----------------------------
DROP TABLE IF EXISTS `sys_job`;
CREATE TABLE `sys_job`  (
  `job_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '任务ID',
  `job_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '' COMMENT '任务名称',
  `job_group` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'DEFAULT' COMMENT '任务组名',
  `invoke_target` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调用目标字符串',
  `cron_expression` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT 'cron执行表达式',
  `misfire_policy` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '3' COMMENT '计划执行错误策略（1立即执行 2执行一次 3放弃执行）',
  `concurrent` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '1' COMMENT '是否并发执行（0允许 1禁止）',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '状态（0正常 1暂停）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '备注信息',
  PRIMARY KEY (`job_id`, `job_name`, `job_group`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 101 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '定时任务调度表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_job
-- ----------------------------
INSERT INTO `sys_job` VALUES (1, '系统默认（无参）', 'DEFAULT', 'ryTask.ryNoParams', '0/10 * * * * ?', '3', '1', '1', 'admin', '2024-10-07 10:26:53', '', NULL, '');
INSERT INTO `sys_job` VALUES (2, '系统默认（有参）', 'DEFAULT', 'ryTask.ryParams(\'ry\')', '0/15 * * * * ?', '3', '1', '1', 'admin', '2024-10-07 10:26:53', '', NULL, '');
INSERT INTO `sys_job` VALUES (3, '系统默认（多参）', 'DEFAULT', 'ryTask.ryMultipleParams(\'ry\', true, 2000L, 316.50D, 100)', '0/20 * * * * ?', '3', '1', '1', 'admin', '2024-10-07 10:26:53', '', NULL, '');
INSERT INTO `sys_job` VALUES (100, '展示时间', 'DEFAULT', 'myTask.showTime()', '0/5 * * * * ?', '1', '1', '1', 'admin', '2024-10-08 09:49:13', '', '2024-10-08 09:49:47', '');

-- ----------------------------
-- Table structure for sys_job_log
-- ----------------------------
DROP TABLE IF EXISTS `sys_job_log`;
CREATE TABLE `sys_job_log`  (
  `job_log_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '任务日志ID',
  `job_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务名称',
  `job_group` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务组名',
  `invoke_target` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调用目标字符串',
  `job_message` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '日志信息',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '执行状态（0正常 1失败）',
  `exception_info` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '异常信息',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`job_log_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '定时任务调度日志表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_job_log
-- ----------------------------
INSERT INTO `sys_job_log` VALUES (1, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：7毫秒', '0', '', '2024-10-08 09:49:21');
INSERT INTO `sys_job_log` VALUES (2, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：0毫秒', '0', '', '2024-10-08 09:49:21');
INSERT INTO `sys_job_log` VALUES (3, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：0毫秒', '0', '', '2024-10-08 09:49:25');
INSERT INTO `sys_job_log` VALUES (4, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：1毫秒', '0', '', '2024-10-08 09:49:30');
INSERT INTO `sys_job_log` VALUES (5, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：0毫秒', '0', '', '2024-10-08 09:49:35');
INSERT INTO `sys_job_log` VALUES (6, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：0毫秒', '0', '', '2024-10-08 09:49:40');
INSERT INTO `sys_job_log` VALUES (7, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：0毫秒', '0', '', '2024-10-08 09:49:45');
INSERT INTO `sys_job_log` VALUES (8, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：0毫秒', '0', '', '2024-10-08 10:01:42');
INSERT INTO `sys_job_log` VALUES (9, '系统默认（多参）', 'DEFAULT', 'ryTask.ryMultipleParams(\'ry\', true, 2000L, 316.50D, 100)', '系统默认（多参） 总共耗时：0毫秒', '0', '', '2024-10-08 10:09:10');
INSERT INTO `sys_job_log` VALUES (10, '展示时间', 'DEFAULT', 'myTask.showTime()', '展示时间 总共耗时：1毫秒', '0', '', '2024-10-08 11:27:49');

-- ----------------------------
-- Table structure for sys_logininfor
-- ----------------------------
DROP TABLE IF EXISTS `sys_logininfor`;
CREATE TABLE `sys_logininfor`  (
  `info_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '访问ID',
  `user_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '用户账号',
  `ipaddr` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '登录IP地址',
  `login_location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '登录地点',
  `browser` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '浏览器类型',
  `os` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '操作系统',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '登录状态（0成功 1失败）',
  `msg` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '提示消息',
  `login_time` datetime NULL DEFAULT NULL COMMENT '访问时间',
  PRIMARY KEY (`info_id`) USING BTREE,
  INDEX `idx_sys_logininfor_s`(`status` ASC) USING BTREE,
  INDEX `idx_sys_logininfor_lt`(`login_time` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 126 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '系统访问记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_logininfor
-- ----------------------------
INSERT INTO `sys_logininfor` VALUES (100, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-07 10:45:55');
INSERT INTO `sys_logininfor` VALUES (101, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-07 13:35:24');
INSERT INTO `sys_logininfor` VALUES (102, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '退出成功', '2024-10-07 13:57:49');
INSERT INTO `sys_logininfor` VALUES (103, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-07 13:57:56');
INSERT INTO `sys_logininfor` VALUES (104, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-07 15:27:57');
INSERT INTO `sys_logininfor` VALUES (105, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '退出成功', '2024-10-07 15:45:08');
INSERT INTO `sys_logininfor` VALUES (106, 'fming', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-07 15:45:28');
INSERT INTO `sys_logininfor` VALUES (107, 'fming', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '退出成功', '2024-10-07 15:45:44');
INSERT INTO `sys_logininfor` VALUES (108, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-07 15:45:55');
INSERT INTO `sys_logininfor` VALUES (109, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 09:47:56');
INSERT INTO `sys_logininfor` VALUES (110, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '1', '验证码错误', '2024-10-08 11:07:35');
INSERT INTO `sys_logininfor` VALUES (111, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 11:07:38');
INSERT INTO `sys_logininfor` VALUES (112, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 13:37:01');
INSERT INTO `sys_logininfor` VALUES (113, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 14:31:46');
INSERT INTO `sys_logininfor` VALUES (114, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 15:50:51');
INSERT INTO `sys_logininfor` VALUES (115, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 16:30:08');
INSERT INTO `sys_logininfor` VALUES (116, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-08 17:31:10');
INSERT INTO `sys_logininfor` VALUES (117, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-09 08:48:34');
INSERT INTO `sys_logininfor` VALUES (118, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-09 10:23:45');
INSERT INTO `sys_logininfor` VALUES (119, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-09 13:38:54');
INSERT INTO `sys_logininfor` VALUES (120, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-10 08:34:17');
INSERT INTO `sys_logininfor` VALUES (121, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-10 11:07:38');
INSERT INTO `sys_logininfor` VALUES (122, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-10 13:47:24');
INSERT INTO `sys_logininfor` VALUES (123, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-10 18:04:20');
INSERT INTO `sys_logininfor` VALUES (124, 'admin', '127.0.0.1', '内网IP', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-11 08:30:57');
INSERT INTO `sys_logininfor` VALUES (125, 'admin', '119.123.55.39', 'XX XX', 'Chrome 12', 'Windows 10', '0', '登录成功', '2024-10-11 09:35:33');

-- ----------------------------
-- Table structure for sys_menu
-- ----------------------------
DROP TABLE IF EXISTS `sys_menu`;
CREATE TABLE `sys_menu`  (
  `menu_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '菜单ID',
  `menu_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '菜单名称',
  `parent_id` bigint(20) NULL DEFAULT 0 COMMENT '父菜单ID',
  `order_num` int(4) NULL DEFAULT 0 COMMENT '显示顺序',
  `path` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '路由地址',
  `component` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '组件路径',
  `query` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '路由参数',
  `route_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '路由名称',
  `is_frame` int(1) NULL DEFAULT 1 COMMENT '是否为外链（0是 1否）',
  `is_cache` int(1) NULL DEFAULT 0 COMMENT '是否缓存（0缓存 1不缓存）',
  `menu_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '菜单类型（M目录 C菜单 F按钮）',
  `visible` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '菜单状态（0显示 1隐藏）',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '菜单状态（0正常 1停用）',
  `perms` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '权限标识',
  `icon` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '#' COMMENT '菜单图标',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '备注',
  PRIMARY KEY (`menu_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2034 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '菜单权限表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_menu
-- ----------------------------
INSERT INTO `sys_menu` VALUES (1, '系统管理', 0, 1, 'system', NULL, '', '', 1, 0, 'M', '0', '0', '', 'system', 'admin', '2024-10-07 10:26:52', '', NULL, '系统管理目录');
INSERT INTO `sys_menu` VALUES (2, '系统监控', 0, 2, 'monitor', NULL, '', '', 1, 0, 'M', '0', '0', '', 'monitor', 'admin', '2024-10-07 10:26:52', '', NULL, '系统监控目录');
INSERT INTO `sys_menu` VALUES (3, '系统工具', 0, 3, 'tool', NULL, '', '', 1, 0, 'M', '0', '0', '', 'tool', 'admin', '2024-10-07 10:26:52', '', NULL, '系统工具目录');
INSERT INTO `sys_menu` VALUES (4, '若依官网', 0, 4, 'http://ruoyi.vip', NULL, '', '', 0, 0, 'M', '0', '0', '', 'guide', 'admin', '2024-10-07 10:26:52', '', NULL, '若依官网地址');
INSERT INTO `sys_menu` VALUES (100, '用户管理', 1, 1, 'user', 'system/user/index', '', '', 1, 0, 'C', '0', '0', 'system:user:list', 'user', 'admin', '2024-10-07 10:26:52', '', NULL, '用户管理菜单');
INSERT INTO `sys_menu` VALUES (101, '角色管理', 1, 2, 'role', 'system/role/index', '', '', 1, 0, 'C', '0', '0', 'system:role:list', 'peoples', 'admin', '2024-10-07 10:26:52', '', NULL, '角色管理菜单');
INSERT INTO `sys_menu` VALUES (102, '菜单管理', 1, 3, 'menu', 'system/menu/index', '', '', 1, 0, 'C', '0', '0', 'system:menu:list', 'tree-table', 'admin', '2024-10-07 10:26:52', '', NULL, '菜单管理菜单');
INSERT INTO `sys_menu` VALUES (103, '部门管理', 1, 4, 'dept', 'system/dept/index', '', '', 1, 0, 'C', '0', '0', 'system:dept:list', 'tree', 'admin', '2024-10-07 10:26:52', '', NULL, '部门管理菜单');
INSERT INTO `sys_menu` VALUES (104, '岗位管理', 1, 5, 'post', 'system/post/index', '', '', 1, 0, 'C', '0', '0', 'system:post:list', 'post', 'admin', '2024-10-07 10:26:52', '', NULL, '岗位管理菜单');
INSERT INTO `sys_menu` VALUES (105, '字典管理', 1, 6, 'dict', 'system/dict/index', '', '', 1, 0, 'C', '0', '0', 'system:dict:list', 'dict', 'admin', '2024-10-07 10:26:52', '', NULL, '字典管理菜单');
INSERT INTO `sys_menu` VALUES (106, '参数设置', 1, 7, 'config', 'system/config/index', '', '', 1, 0, 'C', '0', '0', 'system:config:list', 'edit', 'admin', '2024-10-07 10:26:52', '', NULL, '参数设置菜单');
INSERT INTO `sys_menu` VALUES (107, '通知公告', 1, 8, 'notice', 'system/notice/index', '', '', 1, 0, 'C', '0', '0', 'system:notice:list', 'message', 'admin', '2024-10-07 10:26:52', '', NULL, '通知公告菜单');
INSERT INTO `sys_menu` VALUES (108, '日志管理', 1, 9, 'log', '', '', '', 1, 0, 'M', '0', '0', '', 'log', 'admin', '2024-10-07 10:26:52', '', NULL, '日志管理菜单');
INSERT INTO `sys_menu` VALUES (109, '在线用户', 2, 1, 'online', 'monitor/online/index', '', '', 1, 0, 'C', '0', '0', 'monitor:online:list', 'online', 'admin', '2024-10-07 10:26:52', '', NULL, '在线用户菜单');
INSERT INTO `sys_menu` VALUES (110, '定时任务', 2, 2, 'job', 'monitor/job/index', '', '', 1, 0, 'C', '0', '0', 'monitor:job:list', 'job', 'admin', '2024-10-07 10:26:52', '', NULL, '定时任务菜单');
INSERT INTO `sys_menu` VALUES (111, '数据监控', 2, 3, 'druid', 'monitor/druid/index', '', '', 1, 0, 'C', '0', '0', 'monitor:druid:list', 'druid', 'admin', '2024-10-07 10:26:52', '', NULL, '数据监控菜单');
INSERT INTO `sys_menu` VALUES (112, '服务监控', 2, 4, 'server', 'monitor/server/index', '', '', 1, 0, 'C', '0', '0', 'monitor:server:list', 'server', 'admin', '2024-10-07 10:26:52', '', NULL, '服务监控菜单');
INSERT INTO `sys_menu` VALUES (113, '缓存监控', 2, 5, 'cache', 'monitor/cache/index', '', '', 1, 0, 'C', '0', '0', 'monitor:cache:list', 'redis', 'admin', '2024-10-07 10:26:52', '', NULL, '缓存监控菜单');
INSERT INTO `sys_menu` VALUES (114, '缓存列表', 2, 6, 'cacheList', 'monitor/cache/list', '', '', 1, 0, 'C', '0', '0', 'monitor:cache:list', 'redis-list', 'admin', '2024-10-07 10:26:52', '', NULL, '缓存列表菜单');
INSERT INTO `sys_menu` VALUES (115, '表单构建', 3, 1, 'build', 'tool/build/index', '', '', 1, 0, 'C', '0', '0', 'tool:build:list', 'build', 'admin', '2024-10-07 10:26:52', '', NULL, '表单构建菜单');
INSERT INTO `sys_menu` VALUES (116, '代码生成', 3, 2, 'gen', 'tool/gen/index', '', '', 1, 0, 'C', '0', '0', 'tool:gen:list', 'code', 'admin', '2024-10-07 10:26:52', '', NULL, '代码生成菜单');
INSERT INTO `sys_menu` VALUES (117, '系统接口', 3, 3, 'swagger', 'tool/swagger/index', '', '', 1, 0, 'C', '0', '0', 'tool:swagger:list', 'swagger', 'admin', '2024-10-07 10:26:52', '', NULL, '系统接口菜单');
INSERT INTO `sys_menu` VALUES (500, '操作日志', 108, 1, 'operlog', 'monitor/operlog/index', '', '', 1, 0, 'C', '0', '0', 'monitor:operlog:list', 'form', 'admin', '2024-10-07 10:26:52', '', NULL, '操作日志菜单');
INSERT INTO `sys_menu` VALUES (501, '登录日志', 108, 2, 'logininfor', 'monitor/logininfor/index', '', '', 1, 0, 'C', '0', '0', 'monitor:logininfor:list', 'logininfor', 'admin', '2024-10-07 10:26:52', '', NULL, '登录日志菜单');
INSERT INTO `sys_menu` VALUES (1000, '用户查询', 100, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1001, '用户新增', 100, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1002, '用户修改', 100, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1003, '用户删除', 100, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1004, '用户导出', 100, 5, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1005, '用户导入', 100, 6, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:import', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1006, '重置密码', 100, 7, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:resetPwd', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1007, '角色查询', 101, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1008, '角色新增', 101, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1009, '角色修改', 101, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1010, '角色删除', 101, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1011, '角色导出', 101, 5, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1012, '菜单查询', 102, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1013, '菜单新增', 102, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1014, '菜单修改', 102, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1015, '菜单删除', 102, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1016, '部门查询', 103, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1017, '部门新增', 103, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1018, '部门修改', 103, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1019, '部门删除', 103, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1020, '岗位查询', 104, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1021, '岗位新增', 104, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1022, '岗位修改', 104, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1023, '岗位删除', 104, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1024, '岗位导出', 104, 5, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1025, '字典查询', 105, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1026, '字典新增', 105, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1027, '字典修改', 105, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1028, '字典删除', 105, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1029, '字典导出', 105, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1030, '参数查询', 106, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1031, '参数新增', 106, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1032, '参数修改', 106, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1033, '参数删除', 106, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1034, '参数导出', 106, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1035, '公告查询', 107, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1036, '公告新增', 107, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1037, '公告修改', 107, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1038, '公告删除', 107, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1039, '操作查询', 500, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:operlog:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1040, '操作删除', 500, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:operlog:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1041, '日志导出', 500, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:operlog:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1042, '登录查询', 501, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1043, '登录删除', 501, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1044, '日志导出', 501, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1045, '账户解锁', 501, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:unlock', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1046, '在线查询', 109, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:online:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1047, '批量强退', 109, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:online:batchLogout', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1048, '单条强退', 109, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:online:forceLogout', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1049, '任务查询', 110, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1050, '任务新增', 110, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:add', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1051, '任务修改', 110, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1052, '任务删除', 110, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1053, '状态修改', 110, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:changeStatus', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1054, '任务导出', 110, 6, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:export', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1055, '生成查询', 116, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:query', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1056, '生成修改', 116, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:edit', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1057, '生成删除', 116, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:remove', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1058, '导入代码', 116, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:import', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1059, '预览代码', 116, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:preview', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1060, '生成代码', 116, 6, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:code', '#', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2018, '统计分析', 0, 1, 'statistics', NULL, NULL, '', 1, 0, 'M', '0', '0', NULL, 'dashboard', 'admin', '2024-10-07 15:30:24', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2019, '客户统计', 2018, 1, 'customer', NULL, NULL, '', 1, 0, 'C', '0', '0', NULL, 'chart', 'admin', '2024-10-07 15:36:28', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2020, '表单构建-test', 0, 1, 'test', 'classschedule/classschedule/test', NULL, '', 1, 0, 'C', '0', '0', '', 'build', 'admin', '2024-10-08 14:00:05', 'admin', '2024-10-08 14:00:23', '');
INSERT INTO `sys_menu` VALUES (2027, 'fx课表', 0, 1, 'classschedule', 'classschedule/classschedule/index', NULL, '', 1, 0, 'C', '0', '0', 'classschedule:classschedule:list', '#', 'admin', '2024-10-09 11:16:59', '', NULL, 'fx课表菜单');
INSERT INTO `sys_menu` VALUES (2028, 'fx课表查询', 2027, 1, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'classschedule:classschedule:query', '#', 'admin', '2024-10-09 11:16:59', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2029, 'fx课表新增', 2027, 2, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'classschedule:classschedule:add', '#', 'admin', '2024-10-09 11:16:59', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2030, 'fx课表修改', 2027, 3, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'classschedule:classschedule:edit', '#', 'admin', '2024-10-09 11:16:59', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2031, 'fx课表删除', 2027, 4, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'classschedule:classschedule:remove', '#', 'admin', '2024-10-09 11:16:59', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2032, 'fx课表导出', 2027, 5, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'classschedule:classschedule:export', '#', 'admin', '2024-10-09 11:16:59', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2033, 'fx课表换课查询', 2027, 6, '#', NULL, NULL, '', 1, 0, 'F', '0', '0', 'classschedule:classschedule:querychange', '#', 'admin', '2024-10-09 14:51:15', '', NULL, '');

-- ----------------------------
-- Table structure for sys_notice
-- ----------------------------
DROP TABLE IF EXISTS `sys_notice`;
CREATE TABLE `sys_notice`  (
  `notice_id` int(4) NOT NULL AUTO_INCREMENT COMMENT '公告ID',
  `notice_title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '公告标题',
  `notice_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '公告类型（1通知 2公告）',
  `notice_content` longblob NULL COMMENT '公告内容',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '公告状态（0正常 1关闭）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`notice_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '通知公告表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_notice
-- ----------------------------
INSERT INTO `sys_notice` VALUES (1, '温馨提醒：2018-07-01 若依新版本发布啦', '2', 0xE696B0E78988E69CACE58685E5AEB9, '0', 'admin', '2024-10-07 10:26:53', '', NULL, '管理员');
INSERT INTO `sys_notice` VALUES (2, '维护通知：2018-07-01 若依系统凌晨维护', '1', 0xE7BBB4E68AA4E58685E5AEB9, '0', 'admin', '2024-10-07 10:26:53', '', NULL, '管理员');
INSERT INTO `sys_notice` VALUES (10, '通知test', '1', 0x3C703EE9809AE79FA5E9809AE79FA5E9809AE79FA5E9809AE79FA5E9809AE79FA5E9809AE79FA5E9809AE79FA5E9809AE79FA53C696D67207372633D222F6465762D6170692F70726F66696C652F75706C6F61642F323032342F31302F30372F353133393238353662343035363664303039303031653831643466323036305F3230323431303037313730313033413030312E6A7067223E3C2F703E, '0', 'admin', '2024-10-07 16:56:55', 'admin', '2024-10-07 17:01:11', NULL);

-- ----------------------------
-- Table structure for sys_oper_log
-- ----------------------------
DROP TABLE IF EXISTS `sys_oper_log`;
CREATE TABLE `sys_oper_log`  (
  `oper_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '日志主键',
  `title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '模块标题',
  `business_type` int(2) NULL DEFAULT 0 COMMENT '业务类型（0其它 1新增 2修改 3删除）',
  `method` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '方法名称',
  `request_method` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '请求方式',
  `operator_type` int(1) NULL DEFAULT 0 COMMENT '操作类别（0其它 1后台用户 2手机端用户）',
  `oper_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '操作人员',
  `dept_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '部门名称',
  `oper_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '请求URL',
  `oper_ip` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '主机地址',
  `oper_location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '操作地点',
  `oper_param` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '请求参数',
  `json_result` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '返回参数',
  `status` int(1) NULL DEFAULT 0 COMMENT '操作状态（0正常 1异常）',
  `error_msg` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '错误消息',
  `oper_time` datetime NULL DEFAULT NULL COMMENT '操作时间',
  `cost_time` bigint(20) NULL DEFAULT 0 COMMENT '消耗时间',
  PRIMARY KEY (`oper_id`) USING BTREE,
  INDEX `idx_sys_oper_log_bt`(`business_type` ASC) USING BTREE,
  INDEX `idx_sys_oper_log_s`(`status` ASC) USING BTREE,
  INDEX `idx_sys_oper_log_ot`(`oper_time` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 158 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '操作日志记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_oper_log
-- ----------------------------
INSERT INTO `sys_oper_log` VALUES (100, '代码生成', 6, 'com.ruoyi.generator.controller.GenController.importTableSave()', 'POST', 1, 'admin', '研发部门', '/tool/gen/importTable', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 10:59:27', 182);
INSERT INTO `sys_oper_log` VALUES (101, '代码生成', 2, 'com.ruoyi.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"class-schedule\",\"className\":\"ClassSchedule\",\"columns\":[{\"capJavaField\":\"Id\",\"columnComment\":\"课程id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int(11) unsigned\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isList\":\"1\",\"isPk\":\"1\",\"isQuery\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":true,\"query\":true,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"SingleDoubleWeek\",\"columnComment\":\"是否单双周课程（0：否，1：单周，2：双周）\",\"columnId\":2,\"columnName\":\"single_double_week\",\"columnType\":\"int(11)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"singleDoubleWeek\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"ClassId\",\"columnComment\":\"班级id\",\"columnId\":3,\"columnName\":\"class_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"classId\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"ClassHourId\",\"columnComment\":\"课时id\",\"columnId\":4,\"columnName\":\"class_hour_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isI', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 11:14:28', 199);
INSERT INTO `sys_oper_log` VALUES (102, '代码生成', 8, 'com.ruoyi.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-07 11:15:12', 688);
INSERT INTO `sys_oper_log` VALUES (103, '代码生成', 2, 'com.ruoyi.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"classschedule\",\"className\":\"ClassSchedule\",\"columns\":[{\"capJavaField\":\"Id\",\"columnComment\":\"课程id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int(11) unsigned\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isList\":\"1\",\"isPk\":\"1\",\"isQuery\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":true,\"query\":true,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 11:14:28\",\"usableColumn\":false},{\"capJavaField\":\"SingleDoubleWeek\",\"columnComment\":\"是否单双周课程（0：否，1：单周，2：双周）\",\"columnId\":2,\"columnName\":\"single_double_week\",\"columnType\":\"int(11)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"singleDoubleWeek\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 11:14:28\",\"usableColumn\":false},{\"capJavaField\":\"ClassId\",\"columnComment\":\"班级id\",\"columnId\":3,\"columnName\":\"class_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"classId\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 11:14:28\",\"usableColumn\":false},{\"capJavaField\":\"ClassHourId\",\"columnComment\":\"课时id\",\"columnId\":4,\"columnName\":\"class_hour_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 ', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 11:32:45', 134);
INSERT INTO `sys_oper_log` VALUES (104, '代码生成', 8, 'com.ruoyi.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-07 11:32:47', 303);
INSERT INTO `sys_oper_log` VALUES (105, '代码生成', 8, 'com.ruoyi.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-07 14:14:48', 474);
INSERT INTO `sys_oper_log` VALUES (106, '课表', 2, 'com.ruoyi.classschedule.controller.ClassScheduleController.edit()', 'PUT', 1, 'admin', '研发部门', '/classschedule/classschedule', '127.0.0.1', '内网IP', '{\"classHourId\":\"1\",\"classId\":\"1\",\"createTime\":\"2024-09-13 17:51:48\",\"deleted\":0,\"id\":1,\"modifyTime\":\"2024-09-14 15:33:18\",\"params\":{},\"singleDoubleWeek\":0,\"subjectId\":\"语文\",\"teacherId\":\"郑少燕1\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 14:46:09', 99);
INSERT INTO `sys_oper_log` VALUES (107, '课表', 2, 'com.ruoyi.classschedule.controller.ClassScheduleController.edit()', 'PUT', 1, 'admin', '研发部门', '/classschedule/classschedule', '127.0.0.1', '内网IP', '{\"classHourId\":\"1\",\"classId\":\"1\",\"createTime\":\"2024-09-13 17:51:48\",\"deleted\":0,\"id\":1,\"modifyTime\":\"2024-09-14 15:33:18\",\"params\":{},\"singleDoubleWeek\":0,\"subjectId\":\"语文\",\"teacherId\":\"郑少燕\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 14:47:16', 125);
INSERT INTO `sys_oper_log` VALUES (108, '菜单管理', 1, 'com.ruoyi.web.controller.system.SysMenuController.add()', 'POST', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createBy\":\"admin\",\"icon\":\"dashboard\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuName\":\"统计分析\",\"menuType\":\"M\",\"orderNum\":1,\"params\":{},\"parentId\":0,\"path\":\"statistics\",\"status\":\"0\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 15:30:24', 193);
INSERT INTO `sys_oper_log` VALUES (109, '菜单管理', 1, 'com.ruoyi.web.controller.system.SysMenuController.add()', 'POST', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createBy\":\"admin\",\"icon\":\"chart\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuName\":\"客户统计\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":2018,\"path\":\"customer\",\"status\":\"0\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 15:36:28', 131);
INSERT INTO `sys_oper_log` VALUES (110, '菜单管理', 2, 'com.ruoyi.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"classschedule/classschedule/index\",\"createTime\":\"2024-10-07 14:16:07\",\"icon\":\"build\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2012,\"menuName\":\"课表\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":0,\"path\":\"classschedule\",\"perms\":\"classschedule:classschedule:list\",\"routeName\":\"\",\"status\":\"0\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 15:36:53', 42);
INSERT INTO `sys_oper_log` VALUES (111, '菜单管理', 2, 'com.ruoyi.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"classschedule/classschedule/index\",\"createTime\":\"2024-10-07 14:16:07\",\"icon\":\"build\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2012,\"menuName\":\"课表管理\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":0,\"path\":\"classschedule\",\"perms\":\"classschedule:classschedule:list\",\"routeName\":\"\",\"status\":\"0\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 15:38:36', 30);
INSERT INTO `sys_oper_log` VALUES (112, '角色管理', 1, 'com.ruoyi.web.controller.system.SysRoleController.add()', 'POST', 1, 'admin', '研发部门', '/system/role', '127.0.0.1', '内网IP', '{\"admin\":false,\"createBy\":\"admin\",\"deptCheckStrictly\":true,\"deptIds\":[],\"flag\":false,\"menuCheckStrictly\":true,\"menuIds\":[2012,2013,2014,2015,2016,2017,2018,2019],\"params\":{},\"roleId\":100,\"roleKey\":\"research\",\"roleName\":\"课研人员\",\"roleSort\":3,\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 15:42:00', 122);
INSERT INTO `sys_oper_log` VALUES (113, '用户管理', 1, 'com.ruoyi.web.controller.system.SysUserController.add()', 'POST', 1, 'admin', '研发部门', '/system/user', '127.0.0.1', '内网IP', '{\"admin\":false,\"createBy\":\"admin\",\"deptId\":103,\"email\":\"148@qq.com\",\"nickName\":\"fming\",\"params\":{},\"phonenumber\":\"18122223333\",\"postIds\":[4],\"roleIds\":[100],\"sex\":\"2\",\"status\":\"0\",\"userId\":100,\"userName\":\"fming\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 15:44:32', 347);
INSERT INTO `sys_oper_log` VALUES (114, '字典类型', 1, 'com.ruoyi.web.controller.system.SysDictTypeController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/type', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"dictName\":\"科目\",\"dictType\":\"course_subject\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:06:42', 183);
INSERT INTO `sys_oper_log` VALUES (115, '字典类型', 2, 'com.ruoyi.web.controller.system.SysDictTypeController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/dict/type', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"createTime\":\"2024-10-07 16:06:42\",\"dictId\":100,\"dictName\":\"科目\",\"dictType\":\"course_subject\",\"params\":{},\"remark\":\"科目列表\",\"status\":\"0\",\"updateBy\":\"admin\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:06:59', 66);
INSERT INTO `sys_oper_log` VALUES (116, '字典类型', 1, 'com.ruoyi.web.controller.system.SysDictTypeController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/type', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"dictName\":\"班级\",\"dictType\":\"course_class\",\"params\":{},\"remark\":\"班级列表\",\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:08:56', 87);
INSERT INTO `sys_oper_log` VALUES (117, '字典数据', 1, 'com.ruoyi.web.controller.system.SysDictDataController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"default\":false,\"dictLabel\":\"一（1）班\",\"dictSort\":1,\"dictType\":\"course_class\",\"dictValue\":\"1\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:10:00', 70);
INSERT INTO `sys_oper_log` VALUES (118, '字典数据', 1, 'com.ruoyi.web.controller.system.SysDictDataController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"default\":false,\"dictLabel\":\"一（2）班\",\"dictSort\":2,\"dictType\":\"course_class\",\"dictValue\":\"2\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:10:44', 57);
INSERT INTO `sys_oper_log` VALUES (119, '代码生成', 2, 'com.ruoyi.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"classschedule\",\"className\":\"ClassSchedule\",\"columns\":[{\"capJavaField\":\"Id\",\"columnComment\":\"课程id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int(11) unsigned\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isList\":\"1\",\"isPk\":\"1\",\"isQuery\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":true,\"query\":true,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 11:32:45\",\"usableColumn\":false},{\"capJavaField\":\"SingleDoubleWeek\",\"columnComment\":\"是否单双周课程（0：否，1：单周，2：双周）\",\"columnId\":2,\"columnName\":\"single_double_week\",\"columnType\":\"int(11)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"singleDoubleWeek\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 11:32:45\",\"usableColumn\":false},{\"capJavaField\":\"ClassId\",\"columnComment\":\"班级id\",\"columnId\":3,\"columnName\":\"class_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_class\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"classId\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 11:32:45\",\"usableColumn\":false},{\"capJavaField\":\"ClassHourId\",\"columnComment\":\"课时id\",\"columnId\":4,\"columnName\":\"class_hour_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\"', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:12:14', 94);
INSERT INTO `sys_oper_log` VALUES (120, '代码生成', 8, 'com.ruoyi.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-07 16:12:18', 580);
INSERT INTO `sys_oper_log` VALUES (121, '字典数据', 1, 'com.ruoyi.web.controller.system.SysDictDataController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"default\":false,\"dictLabel\":\"一（3）班\",\"dictSort\":3,\"dictType\":\"course_class\",\"dictValue\":\"3\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:16:48', 247);
INSERT INTO `sys_oper_log` VALUES (122, '通知公告', 1, 'com.ruoyi.web.controller.system.SysNoticeController.add()', 'POST', 1, 'admin', '研发部门', '/system/notice', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"noticeContent\":\"<p>通知通知通知通知通知通知通知通知</p>\",\"noticeTitle\":\"通知test\",\"noticeType\":\"1\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 16:56:55', 491);
INSERT INTO `sys_oper_log` VALUES (123, '通知公告', 2, 'com.ruoyi.web.controller.system.SysNoticeController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/notice', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"createTime\":\"2024-10-07 16:56:55\",\"noticeContent\":\"<p>通知通知通知通知通知通知通知通知<img src=\\\"/dev-api/profile/upload/2024/10/07/51392856b40566d009001e81d4f2060_20241007170103A001.jpg\\\"></p>\",\"noticeId\":10,\"noticeTitle\":\"通知test\",\"noticeType\":\"1\",\"params\":{},\"status\":\"0\",\"updateBy\":\"admin\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-07 17:01:11', 91);
INSERT INTO `sys_oper_log` VALUES (124, '定时任务', 1, 'com.ruoyi.quartz.controller.SysJobController.add()', 'POST', 1, 'admin', '研发部门', '/monitor/job', '127.0.0.1', '内网IP', '{\"concurrent\":\"1\",\"createBy\":\"admin\",\"cronExpression\":\"0/5 * * * * ?\",\"invokeTarget\":\"myTask.showTime()\",\"jobGroup\":\"DEFAULT\",\"jobId\":100,\"jobName\":\"展示时间\",\"misfirePolicy\":\"1\",\"nextValidTime\":\"2024-10-08 09:49:15\",\"params\":{},\"status\":\"1\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 09:49:13', 60);
INSERT INTO `sys_oper_log` VALUES (125, '定时任务', 2, 'com.ruoyi.quartz.controller.SysJobController.changeStatus()', 'PUT', 1, 'admin', '研发部门', '/monitor/job/changeStatus', '127.0.0.1', '内网IP', '{\"jobId\":100,\"misfirePolicy\":\"0\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 09:49:21', 54);
INSERT INTO `sys_oper_log` VALUES (126, '定时任务', 2, 'com.ruoyi.quartz.controller.SysJobController.changeStatus()', 'PUT', 1, 'admin', '研发部门', '/monitor/job/changeStatus', '127.0.0.1', '内网IP', '{\"jobId\":100,\"misfirePolicy\":\"0\",\"params\":{},\"status\":\"1\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 09:49:47', 23);
INSERT INTO `sys_oper_log` VALUES (127, '定时任务', 2, 'com.ruoyi.quartz.controller.SysJobController.run()', 'PUT', 1, 'admin', '研发部门', '/monitor/job/run', '127.0.0.1', '内网IP', '{\"jobGroup\":\"DEFAULT\",\"jobId\":100,\"misfirePolicy\":\"0\",\"params\":{}}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 10:01:42', 8);
INSERT INTO `sys_oper_log` VALUES (128, '课表', 5, 'com.ruoyi.classschedule.controller.ClassScheduleController.export()', 'POST', 1, 'admin', '研发部门', '/classschedule/classschedule/export', '127.0.0.1', '内网IP', '{\"teacherId\":\"郭霄涵\",\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2024-10-08 10:03:15', 1078);
INSERT INTO `sys_oper_log` VALUES (129, '定时任务', 2, 'com.ruoyi.quartz.controller.SysJobController.run()', 'PUT', 1, 'admin', '研发部门', '/monitor/job/run', '127.0.0.1', '内网IP', '{\"jobGroup\":\"DEFAULT\",\"jobId\":3,\"misfirePolicy\":\"0\",\"params\":{}}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 10:09:10', 6);
INSERT INTO `sys_oper_log` VALUES (130, '定时任务', 2, 'com.ruoyi.quartz.controller.SysJobController.run()', 'PUT', 1, 'admin', '研发部门', '/monitor/job/run', '127.0.0.1', '内网IP', '{\"jobGroup\":\"DEFAULT\",\"jobId\":100,\"misfirePolicy\":\"0\",\"params\":{}}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 11:27:49', 6);
INSERT INTO `sys_oper_log` VALUES (131, '菜单管理', 1, 'com.ruoyi.web.controller.system.SysMenuController.add()', 'POST', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createBy\":\"admin\",\"icon\":\"build\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuName\":\"表单构建-test\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":0,\"path\":\"test\",\"status\":\"0\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 14:00:05', 119);
INSERT INTO `sys_oper_log` VALUES (132, '菜单管理', 2, 'com.ruoyi.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"classschedule/classschedule/test\",\"createTime\":\"2024-10-08 14:00:05\",\"icon\":\"build\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2020,\"menuName\":\"表单构建-test\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":0,\"path\":\"test\",\"perms\":\"\",\"routeName\":\"\",\"status\":\"0\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 14:00:23', 116);
INSERT INTO `sys_oper_log` VALUES (133, '课表', 5, 'com.ruoyi.classschedule.controller.ClassScheduleController.export()', 'POST', 1, 'admin', '研发部门', '/classschedule/classschedule/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2024-10-08 15:53:58', 1265);
INSERT INTO `sys_oper_log` VALUES (134, '课表', 5, 'com.ruoyi.classschedule.controller.ClassScheduleController.export()', 'POST', 1, 'admin', '研发部门', '/classschedule/classschedule/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2024-10-08 15:55:46', 154);
INSERT INTO `sys_oper_log` VALUES (135, '课表', 5, 'com.ruoyi.classschedule.controller.ClassScheduleController.export()', 'POST', 1, 'admin', '研发部门', '/classschedule/classschedule/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2024-10-08 15:58:26', 1805);
INSERT INTO `sys_oper_log` VALUES (136, '课表', 5, 'com.ruoyi.classschedule.controller.ClassScheduleController.export()', 'POST', 1, 'admin', '研发部门', '/classschedule/classschedule/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2024-10-08 16:00:37', 1881);
INSERT INTO `sys_oper_log` VALUES (137, '字典类型', 1, 'com.ruoyi.web.controller.system.SysDictTypeController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/type', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"dictName\":\"单双周类型\",\"dictType\":\"course_week_type\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 17:46:26', 114);
INSERT INTO `sys_oper_log` VALUES (138, '字典数据', 1, 'com.ruoyi.web.controller.system.SysDictDataController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"default\":false,\"dictLabel\":\"单周\",\"dictSort\":1,\"dictType\":\"course_week_type\",\"dictValue\":\"1\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 17:46:46', 124);
INSERT INTO `sys_oper_log` VALUES (139, '字典数据', 1, 'com.ruoyi.web.controller.system.SysDictDataController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"default\":false,\"dictLabel\":\"双周\",\"dictSort\":2,\"dictType\":\"course_week_type\",\"dictValue\":\"2\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 17:46:56', 44);
INSERT INTO `sys_oper_log` VALUES (140, '字典类型', 2, 'com.ruoyi.web.controller.system.SysDictTypeController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/dict/type', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"createTime\":\"2024-10-08 17:46:26\",\"dictId\":102,\"dictName\":\"单双周类型\",\"dictType\":\"course_week_type\",\"params\":{},\"remark\":\"单双周类型\",\"status\":\"0\",\"updateBy\":\"admin\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 17:47:13', 77);
INSERT INTO `sys_oper_log` VALUES (141, '代码生成', 2, 'com.ruoyi.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"classschedule\",\"className\":\"ClassSchedule\",\"columns\":[{\"capJavaField\":\"Id\",\"columnComment\":\"课程id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int(11) unsigned\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isList\":\"1\",\"isPk\":\"1\",\"isQuery\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":true,\"query\":true,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 16:12:14\",\"usableColumn\":false},{\"capJavaField\":\"SingleDoubleWeek\",\"columnComment\":\"单双周课程\",\"columnId\":2,\"columnName\":\"single_double_week\",\"columnType\":\"int(11)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_week_type\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"singleDoubleWeek\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 16:12:14\",\"usableColumn\":false},{\"capJavaField\":\"ClassId\",\"columnComment\":\"班级id\",\"columnId\":3,\"columnName\":\"class_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_class\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"classId\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-07 16:12:14\",\"usableColumn\":false},{\"capJavaField\":\"ClassHourId\",\"columnComment\":\"课时id\",\"columnId\":4,\"columnName\":\"class_hour_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\"', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-08 17:59:40', 76);
INSERT INTO `sys_oper_log` VALUES (142, '代码生成', 8, 'com.ruoyi.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-08 17:59:43', 462);
INSERT INTO `sys_oper_log` VALUES (143, '字典数据', 1, 'com.fxcourse.web.controller.system.SysDictDataController.add()', 'POST', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"default\":false,\"dictLabel\":\"否\",\"dictSort\":0,\"dictType\":\"course_week_type\",\"dictValue\":\"0\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 10:53:40', 281);
INSERT INTO `sys_oper_log` VALUES (144, '代码生成', 2, 'com.fxcourse.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"classschedule\",\"className\":\"ClassSchedule\",\"columns\":[{\"capJavaField\":\"Id\",\"columnComment\":\"课程id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int(11) unsigned\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isList\":\"0\",\"isPk\":\"1\",\"isQuery\":\"0\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"Integer\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-08 17:59:40\",\"usableColumn\":false},{\"capJavaField\":\"SingleDoubleWeek\",\"columnComment\":\"单双周课程\",\"columnId\":2,\"columnName\":\"single_double_week\",\"columnType\":\"int(11)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_week_type\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"singleDoubleWeek\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-08 17:59:40\",\"usableColumn\":false},{\"capJavaField\":\"ClassId\",\"columnComment\":\"班级\",\"columnId\":3,\"columnName\":\"class_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_class\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"classId\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-08 17:59:40\",\"usableColumn\":false},{\"capJavaField\":\"ClassHourId\",\"columnComment\":\"课时\",\"columnId\":4,\"columnName\":\"class_hour_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"20', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 11:10:33', 294);
INSERT INTO `sys_oper_log` VALUES (145, '代码生成', 8, 'com.fxcourse.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-09 11:10:37', 131);
INSERT INTO `sys_oper_log` VALUES (146, '代码生成', 2, 'com.fxcourse.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"classschedule\",\"className\":\"ClassSchedule\",\"columns\":[{\"capJavaField\":\"Id\",\"columnComment\":\"课程id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int(11) unsigned\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isList\":\"0\",\"isPk\":\"1\",\"isQuery\":\"0\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"Integer\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-09 11:10:33\",\"usableColumn\":false},{\"capJavaField\":\"SingleDoubleWeek\",\"columnComment\":\"单双周课程\",\"columnId\":2,\"columnName\":\"single_double_week\",\"columnType\":\"int(11)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_week_type\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"singleDoubleWeek\",\"javaType\":\"Integer\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-09 11:10:33\",\"usableColumn\":false},{\"capJavaField\":\"ClassId\",\"columnComment\":\"班级\",\"columnId\":3,\"columnName\":\"class_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"2024-10-07 10:59:27\",\"dictType\":\"course_class\",\"edit\":true,\"htmlType\":\"select\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"classId\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2024-10-09 11:10:33\",\"usableColumn\":false},{\"capJavaField\":\"ClassHourId\",\"columnComment\":\"课时\",\"columnId\":4,\"columnName\":\"class_hour_id\",\"columnType\":\"varchar(32)\",\"createBy\":\"admin\",\"createTime\":\"20', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 11:15:46', 209);
INSERT INTO `sys_oper_log` VALUES (147, '代码生成', 8, 'com.fxcourse.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"class_schedule\"}', NULL, 0, NULL, '2024-10-09 11:15:50', 713);
INSERT INTO `sys_oper_log` VALUES (148, '菜单管理', 3, 'com.fxcourse.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/2012', '127.0.0.1', '内网IP', '{}', '{\"msg\":\"存在子菜单,不允许删除\",\"code\":601}', 0, NULL, '2024-10-09 11:23:54', 7);
INSERT INTO `sys_oper_log` VALUES (149, '菜单管理', 3, 'com.fxcourse.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/2013', '127.0.0.1', '内网IP', '{}', '{\"msg\":\"菜单已分配,不允许删除\",\"code\":601}', 0, NULL, '2024-10-09 11:24:01', 10);
INSERT INTO `sys_oper_log` VALUES (150, '菜单管理', 2, 'com.fxcourse.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"\",\"createTime\":\"2024-10-07 14:16:07\",\"icon\":\"#\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2013,\"menuName\":\"课表查询\",\"menuType\":\"F\",\"orderNum\":1,\"params\":{},\"parentId\":2012,\"path\":\"#\",\"perms\":\"classschedule:classschedule:query\",\"routeName\":\"\",\"status\":\"1\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 11:24:17', 89);
INSERT INTO `sys_oper_log` VALUES (151, '菜单管理', 3, 'com.fxcourse.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/2013', '127.0.0.1', '内网IP', '{}', '{\"msg\":\"菜单已分配,不允许删除\",\"code\":601}', 0, NULL, '2024-10-09 11:24:22', 17);
INSERT INTO `sys_oper_log` VALUES (152, '菜单管理', 2, 'com.fxcourse.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"\",\"createTime\":\"2024-10-07 14:16:07\",\"icon\":\"#\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2013,\"menuName\":\"课表查询\",\"menuType\":\"F\",\"orderNum\":1,\"params\":{},\"parentId\":2012,\"path\":\"#\",\"perms\":\"classschedule:classschedule:query\",\"routeName\":\"\",\"status\":\"0\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 11:24:27', 27);
INSERT INTO `sys_oper_log` VALUES (153, '字典数据', 2, 'com.fxcourse.web.controller.system.SysDictDataController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/dict/data', '127.0.0.1', '内网IP', '{\"createBy\":\"admin\",\"createTime\":\"2024-10-07 16:16:48\",\"default\":false,\"dictCode\":102,\"dictLabel\":\"一（3）班\",\"dictSort\":3,\"dictType\":\"course_class\",\"dictValue\":\"3\",\"isDefault\":\"N\",\"listClass\":\"default\",\"params\":{},\"status\":\"0\",\"updateBy\":\"admin\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 11:40:08', 111);
INSERT INTO `sys_oper_log` VALUES (154, 'fx课表', 2, 'com.fxcourse.classschedule.controller.ClassScheduleController.edit()', 'PUT', 1, 'admin', '研发部门', '/classschedule/classschedule', '127.0.0.1', '内网IP', '{\"classHourId\":\"1\",\"classId\":\"1\",\"createTime\":\"2024-09-13 17:51:48\",\"deleted\":0,\"id\":1,\"modifyTime\":\"2024-09-14\",\"params\":{},\"singleDoubleWeek\":0,\"subjectId\":\"语文\",\"teacherId\":\"郑少燕\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 14:31:06', 81);
INSERT INTO `sys_oper_log` VALUES (155, 'fx课表', 2, 'com.fxcourse.classschedule.controller.ClassScheduleController.edit()', 'PUT', 1, 'admin', '研发部门', '/classschedule/classschedule', '127.0.0.1', '内网IP', '{\"classHourId\":\"1\",\"classId\":\"1\",\"createTime\":\"2024-09-13 17:51:48\",\"deleted\":0,\"id\":1,\"modifyTime\":\"2024-09-14\",\"params\":{},\"singleDoubleWeek\":0,\"subjectId\":\"语文\",\"teacherId\":\"郑少燕1\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 14:38:42', 16);
INSERT INTO `sys_oper_log` VALUES (156, 'fx课表', 2, 'com.fxcourse.classschedule.controller.ClassScheduleController.edit()', 'PUT', 1, 'admin', '研发部门', '/classschedule/classschedule', '127.0.0.1', '内网IP', '{\"classHourId\":\"1\",\"classId\":\"1\",\"createTime\":\"2024-09-13 17:51:48\",\"deleted\":0,\"id\":1,\"modifyTime\":\"2024-09-14\",\"params\":{},\"singleDoubleWeek\":0,\"subjectId\":\"语文\",\"teacherId\":\"郑少燕\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 14:38:53', 96);
INSERT INTO `sys_oper_log` VALUES (157, '菜单管理', 1, 'com.fxcourse.web.controller.system.SysMenuController.add()', 'POST', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createBy\":\"admin\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuName\":\"fx课表换课查询\",\"menuType\":\"F\",\"orderNum\":6,\"params\":{},\"parentId\":2027,\"perms\":\"classschedule:classschedule:querychange\",\"status\":\"0\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2024-10-09 14:51:16', 118);
INSERT INTO `sys_oper_log` VALUES (158, 'fx课表', 5, 'com.fxcourse.classschedule.controller.ClassScheduleController.export()', 'POST', 1, 'admin', '研发部门', '/classschedule/classschedule/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"id\":\"676\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2024-10-10 15:13:54', 2228);

-- ----------------------------
-- Table structure for sys_post
-- ----------------------------
DROP TABLE IF EXISTS `sys_post`;
CREATE TABLE `sys_post`  (
  `post_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '岗位ID',
  `post_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '岗位编码',
  `post_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '岗位名称',
  `post_sort` int(4) NOT NULL COMMENT '显示顺序',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '状态（0正常 1停用）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`post_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '岗位信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_post
-- ----------------------------
INSERT INTO `sys_post` VALUES (1, 'ceo', '董事长', 1, '0', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_post` VALUES (2, 'se', '项目经理', 2, '0', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_post` VALUES (3, 'hr', '人力资源', 3, '0', 'admin', '2024-10-07 10:26:52', '', NULL, '');
INSERT INTO `sys_post` VALUES (4, 'user', '普通员工', 4, '0', 'admin', '2024-10-07 10:26:52', '', NULL, '');

-- ----------------------------
-- Table structure for sys_role
-- ----------------------------
DROP TABLE IF EXISTS `sys_role`;
CREATE TABLE `sys_role`  (
  `role_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '角色ID',
  `role_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色名称',
  `role_key` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色权限字符串',
  `role_sort` int(4) NOT NULL COMMENT '显示顺序',
  `data_scope` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '1' COMMENT '数据范围（1：全部数据权限 2：自定数据权限 3：本部门数据权限 4：本部门及以下数据权限）',
  `menu_check_strictly` tinyint(1) NULL DEFAULT 1 COMMENT '菜单树选择项是否关联显示',
  `dept_check_strictly` tinyint(1) NULL DEFAULT 1 COMMENT '部门树选择项是否关联显示',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色状态（0正常 1停用）',
  `del_flag` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '删除标志（0代表存在 2代表删除）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`role_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 101 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '角色信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_role
-- ----------------------------
INSERT INTO `sys_role` VALUES (1, '超级管理员', 'admin', 1, '1', 1, 1, '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL, '超级管理员');
INSERT INTO `sys_role` VALUES (2, '普通角色', 'common', 2, '2', 1, 1, '0', '0', 'admin', '2024-10-07 10:26:52', '', NULL, '普通角色');
INSERT INTO `sys_role` VALUES (100, '课研人员', 'research', 3, '1', 1, 1, '0', '0', 'admin', '2024-10-07 15:41:59', '', NULL, NULL);

-- ----------------------------
-- Table structure for sys_role_dept
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_dept`;
CREATE TABLE `sys_role_dept`  (
  `role_id` bigint(20) NOT NULL COMMENT '角色ID',
  `dept_id` bigint(20) NOT NULL COMMENT '部门ID',
  PRIMARY KEY (`role_id`, `dept_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '角色和部门关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_role_dept
-- ----------------------------
INSERT INTO `sys_role_dept` VALUES (2, 100);
INSERT INTO `sys_role_dept` VALUES (2, 101);
INSERT INTO `sys_role_dept` VALUES (2, 105);

-- ----------------------------
-- Table structure for sys_role_menu
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_menu`;
CREATE TABLE `sys_role_menu`  (
  `role_id` bigint(20) NOT NULL COMMENT '角色ID',
  `menu_id` bigint(20) NOT NULL COMMENT '菜单ID',
  PRIMARY KEY (`role_id`, `menu_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '角色和菜单关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_role_menu
-- ----------------------------
INSERT INTO `sys_role_menu` VALUES (2, 1);
INSERT INTO `sys_role_menu` VALUES (2, 2);
INSERT INTO `sys_role_menu` VALUES (2, 3);
INSERT INTO `sys_role_menu` VALUES (2, 4);
INSERT INTO `sys_role_menu` VALUES (2, 100);
INSERT INTO `sys_role_menu` VALUES (2, 101);
INSERT INTO `sys_role_menu` VALUES (2, 102);
INSERT INTO `sys_role_menu` VALUES (2, 103);
INSERT INTO `sys_role_menu` VALUES (2, 104);
INSERT INTO `sys_role_menu` VALUES (2, 105);
INSERT INTO `sys_role_menu` VALUES (2, 106);
INSERT INTO `sys_role_menu` VALUES (2, 107);
INSERT INTO `sys_role_menu` VALUES (2, 108);
INSERT INTO `sys_role_menu` VALUES (2, 109);
INSERT INTO `sys_role_menu` VALUES (2, 110);
INSERT INTO `sys_role_menu` VALUES (2, 111);
INSERT INTO `sys_role_menu` VALUES (2, 112);
INSERT INTO `sys_role_menu` VALUES (2, 113);
INSERT INTO `sys_role_menu` VALUES (2, 114);
INSERT INTO `sys_role_menu` VALUES (2, 115);
INSERT INTO `sys_role_menu` VALUES (2, 116);
INSERT INTO `sys_role_menu` VALUES (2, 117);
INSERT INTO `sys_role_menu` VALUES (2, 500);
INSERT INTO `sys_role_menu` VALUES (2, 501);
INSERT INTO `sys_role_menu` VALUES (2, 1000);
INSERT INTO `sys_role_menu` VALUES (2, 1001);
INSERT INTO `sys_role_menu` VALUES (2, 1002);
INSERT INTO `sys_role_menu` VALUES (2, 1003);
INSERT INTO `sys_role_menu` VALUES (2, 1004);
INSERT INTO `sys_role_menu` VALUES (2, 1005);
INSERT INTO `sys_role_menu` VALUES (2, 1006);
INSERT INTO `sys_role_menu` VALUES (2, 1007);
INSERT INTO `sys_role_menu` VALUES (2, 1008);
INSERT INTO `sys_role_menu` VALUES (2, 1009);
INSERT INTO `sys_role_menu` VALUES (2, 1010);
INSERT INTO `sys_role_menu` VALUES (2, 1011);
INSERT INTO `sys_role_menu` VALUES (2, 1012);
INSERT INTO `sys_role_menu` VALUES (2, 1013);
INSERT INTO `sys_role_menu` VALUES (2, 1014);
INSERT INTO `sys_role_menu` VALUES (2, 1015);
INSERT INTO `sys_role_menu` VALUES (2, 1016);
INSERT INTO `sys_role_menu` VALUES (2, 1017);
INSERT INTO `sys_role_menu` VALUES (2, 1018);
INSERT INTO `sys_role_menu` VALUES (2, 1019);
INSERT INTO `sys_role_menu` VALUES (2, 1020);
INSERT INTO `sys_role_menu` VALUES (2, 1021);
INSERT INTO `sys_role_menu` VALUES (2, 1022);
INSERT INTO `sys_role_menu` VALUES (2, 1023);
INSERT INTO `sys_role_menu` VALUES (2, 1024);
INSERT INTO `sys_role_menu` VALUES (2, 1025);
INSERT INTO `sys_role_menu` VALUES (2, 1026);
INSERT INTO `sys_role_menu` VALUES (2, 1027);
INSERT INTO `sys_role_menu` VALUES (2, 1028);
INSERT INTO `sys_role_menu` VALUES (2, 1029);
INSERT INTO `sys_role_menu` VALUES (2, 1030);
INSERT INTO `sys_role_menu` VALUES (2, 1031);
INSERT INTO `sys_role_menu` VALUES (2, 1032);
INSERT INTO `sys_role_menu` VALUES (2, 1033);
INSERT INTO `sys_role_menu` VALUES (2, 1034);
INSERT INTO `sys_role_menu` VALUES (2, 1035);
INSERT INTO `sys_role_menu` VALUES (2, 1036);
INSERT INTO `sys_role_menu` VALUES (2, 1037);
INSERT INTO `sys_role_menu` VALUES (2, 1038);
INSERT INTO `sys_role_menu` VALUES (2, 1039);
INSERT INTO `sys_role_menu` VALUES (2, 1040);
INSERT INTO `sys_role_menu` VALUES (2, 1041);
INSERT INTO `sys_role_menu` VALUES (2, 1042);
INSERT INTO `sys_role_menu` VALUES (2, 1043);
INSERT INTO `sys_role_menu` VALUES (2, 1044);
INSERT INTO `sys_role_menu` VALUES (2, 1045);
INSERT INTO `sys_role_menu` VALUES (2, 1046);
INSERT INTO `sys_role_menu` VALUES (2, 1047);
INSERT INTO `sys_role_menu` VALUES (2, 1048);
INSERT INTO `sys_role_menu` VALUES (2, 1049);
INSERT INTO `sys_role_menu` VALUES (2, 1050);
INSERT INTO `sys_role_menu` VALUES (2, 1051);
INSERT INTO `sys_role_menu` VALUES (2, 1052);
INSERT INTO `sys_role_menu` VALUES (2, 1053);
INSERT INTO `sys_role_menu` VALUES (2, 1054);
INSERT INTO `sys_role_menu` VALUES (2, 1055);
INSERT INTO `sys_role_menu` VALUES (2, 1056);
INSERT INTO `sys_role_menu` VALUES (2, 1057);
INSERT INTO `sys_role_menu` VALUES (2, 1058);
INSERT INTO `sys_role_menu` VALUES (2, 1059);
INSERT INTO `sys_role_menu` VALUES (2, 1060);
INSERT INTO `sys_role_menu` VALUES (100, 2012);
INSERT INTO `sys_role_menu` VALUES (100, 2013);
INSERT INTO `sys_role_menu` VALUES (100, 2014);
INSERT INTO `sys_role_menu` VALUES (100, 2015);
INSERT INTO `sys_role_menu` VALUES (100, 2016);
INSERT INTO `sys_role_menu` VALUES (100, 2017);
INSERT INTO `sys_role_menu` VALUES (100, 2018);
INSERT INTO `sys_role_menu` VALUES (100, 2019);

-- ----------------------------
-- Table structure for sys_user
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user`  (
  `user_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `dept_id` bigint(20) NULL DEFAULT NULL COMMENT '部门ID',
  `user_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户账号',
  `nick_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户昵称',
  `user_type` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '00' COMMENT '用户类型（00系统用户）',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '用户邮箱',
  `phonenumber` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '手机号码',
  `sex` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '用户性别（0男 1女 2未知）',
  `avatar` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '头像地址',
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '密码',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '帐号状态（0正常 1停用）',
  `del_flag` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '删除标志（0代表存在 2代表删除）',
  `login_ip` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '最后登录IP',
  `login_date` datetime NULL DEFAULT NULL COMMENT '最后登录时间',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 101 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES (1, 103, 'admin', '若依', '00', 'ry@163.com', '15888888888', '1', '', '$2a$10$7JB720yubVSZvUI0rEqK/.VqGOZTH.ulu33dHOiBE8ByOhJIrdAu2', '0', '0', '119.123.55.39', '2024-10-11 09:35:34', 'admin', '2024-10-07 10:26:52', '', '2024-10-11 09:35:33', '管理员');
INSERT INTO `sys_user` VALUES (2, 105, 'ry', '若依', '00', 'ry@qq.com', '15666666666', '1', '', '$2a$10$7JB720yubVSZvUI0rEqK/.VqGOZTH.ulu33dHOiBE8ByOhJIrdAu2', '0', '0', '127.0.0.1', '2024-10-07 10:26:52', 'admin', '2024-10-07 10:26:52', '', NULL, '测试员');
INSERT INTO `sys_user` VALUES (100, 103, 'fming', 'fming', '00', '148@qq.com', '18122223333', '2', '', '$2a$10$Ad0.M4ixWNDp6p1li3tvBeJt5K19Mz1YKAY2j5kIqC4nARb3E0Bay', '0', '0', '127.0.0.1', '2024-10-07 15:45:28', 'admin', '2024-10-07 15:44:32', '', '2024-10-07 15:45:28', NULL);

-- ----------------------------
-- Table structure for sys_user_post
-- ----------------------------
DROP TABLE IF EXISTS `sys_user_post`;
CREATE TABLE `sys_user_post`  (
  `user_id` bigint(20) NOT NULL COMMENT '用户ID',
  `post_id` bigint(20) NOT NULL COMMENT '岗位ID',
  PRIMARY KEY (`user_id`, `post_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户与岗位关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user_post
-- ----------------------------
INSERT INTO `sys_user_post` VALUES (1, 1);
INSERT INTO `sys_user_post` VALUES (2, 2);
INSERT INTO `sys_user_post` VALUES (100, 4);

-- ----------------------------
-- Table structure for sys_user_role
-- ----------------------------
DROP TABLE IF EXISTS `sys_user_role`;
CREATE TABLE `sys_user_role`  (
  `user_id` bigint(20) NOT NULL COMMENT '用户ID',
  `role_id` bigint(20) NOT NULL COMMENT '角色ID',
  PRIMARY KEY (`user_id`, `role_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户和角色关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user_role
-- ----------------------------
INSERT INTO `sys_user_role` VALUES (1, 1);
INSERT INTO `sys_user_role` VALUES (2, 2);
INSERT INTO `sys_user_role` VALUES (100, 100);

SET FOREIGN_KEY_CHECKS = 1;
